
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x00002789 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x0000278d)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_base_type
                DW_AT_name	("bool")

0x00000016:   DW_TAG_base_type
                DW_AT_name	("f32")

0x0000001b:   DW_TAG_base_type
                DW_AT_name	("f64")

0x00000020:   DW_TAG_base_type
                DW_AT_name	("i16")

0x00000025:   DW_TAG_base_type
                DW_AT_name	("i32")

0x0000002a:   DW_TAG_base_type
                DW_AT_name	("i64")

0x0000002f:   DW_TAG_base_type
                DW_AT_name	("i8")

0x00000033:   DW_TAG_base_type
                DW_AT_name	("isize")

0x0000003a:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator")
                DW_AT_signature	(0x00000004)

0x00000072:     DW_TAG_member
                  DW_AT_name	("value")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000081:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#get:value")

0x000000bf:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x000000cd:       NULL

0x000000ce:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#set:value")

0x0000010c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x0000011a:       DW_TAG_formal_parameter
                    DW_AT_name	("value")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000129:       NULL

0x0000012a:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#constructor")

0x0000016a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x00000178:       NULL

0x00000179:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#add")

0x000001b1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x000001bf:       DW_TAG_formal_parameter
                    DW_AT_name	("a")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000001ca:       DW_TAG_formal_parameter
                    DW_AT_name	("b")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x000001d5:       NULL

0x000001d6:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#processNullable")

0x0000021a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x00000228:       DW_TAG_formal_parameter
                    DW_AT_name	("input")
                    DW_AT_type	(0x00000ed2 "~lib/string/String")
                    DW_AT_location	(0x00000001)

0x00000237:       NULL

0x00000238:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#getLength")

0x00000276:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x00000284:       DW_TAG_formal_parameter
                    DW_AT_name	("text")
                    DW_AT_type	(0x00000ed2 "~lib/string/String")
                    DW_AT_location	(0x00000001)

0x00000292:       NULL

0x00000293:     NULL

0x00000294:   DW_TAG_base_type
                DW_AT_name	("u16")

0x00000299:   DW_TAG_base_type
                DW_AT_name	("u32")

0x0000029e:   DW_TAG_base_type
                DW_AT_name	("u64")

0x000002a3:   DW_TAG_base_type
                DW_AT_name	("u8")

0x000002a7:   DW_TAG_base_type
                DW_AT_name	("usize")

0x000002ae:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x000002d0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x000002fa:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002ae "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x00000308:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000318:       NULL

0x00000319:     NULL

0x0000031a:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x00000340:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x000002ae "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x00000350:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x000002a7 "usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000363:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000008)

0x00000377:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x000003a4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003b2:       NULL

0x000003b3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x000003e0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003ee:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x000002ae "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x000003fe:       NULL

0x000003ff:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x0000042f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000043d:       NULL

0x0000043e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x0000046e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000047c:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x000002a7 "usize")
                    DW_AT_location	(0x00000001)

0x0000048f:       NULL

0x00000490:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x000004c1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000004cf:       NULL

0x000004d0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x00000501:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000050f:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000523:       NULL

0x00000524:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x00000552:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000560:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000570:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000583:       NULL

0x00000584:     NULL

0x00000585:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x0000059d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/object/Object#constructor")

0x000005bd:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000585 "~lib/object/Object")
                    DW_AT_location	(0x00000000)

0x000005cb:       NULL

0x000005cc:     NULL

0x000005cd:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x000005e7:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x000002a7 "usize")
                  DW_AT_data_member_location	(0x00000000)

0x000005f7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x00000618:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000005cd "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000626:       NULL

0x00000627:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x00000648:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000005cd "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000656:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x000002a7 "usize")
                    DW_AT_location	(0x00000001)

0x00000666:       NULL

0x00000667:     NULL

0x00000668:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x00000683:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x00000299 "u32")
                  DW_AT_data_member_location	(0x00000004)

0x00000693:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x00000299 "u32")
                  DW_AT_data_member_location	(0x00000008)

0x000006a4:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000299 "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x000006b2:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000299 "u32")
                  DW_AT_data_member_location	(0x00000010)

0x000006c2:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x000006e4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000668 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000006f2:       NULL

0x000006f3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x00000715:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000668 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000723:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x00000299 "u32")
                    DW_AT_location	(0x00000001)

0x00000733:       NULL

0x00000734:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x00000757:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000668 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000765:       NULL

0x00000766:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x00000789:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000668 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000797:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x00000299 "u32")
                    DW_AT_location	(0x00000001)

0x000007a8:       NULL

0x000007a9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x000007c9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000668 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000007d7:       NULL

0x000007d8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x000007f8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000668 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000806:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x00000299 "u32")
                    DW_AT_location	(0x00000001)

0x00000814:       NULL

0x00000815:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x00000837:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000668 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000845:       NULL

0x00000846:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x00000868:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000668 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000876:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x00000299 "u32")
                    DW_AT_location	(0x00000001)

0x00000886:       NULL

0x00000887:     NULL

0x00000888:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x000008a2:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x000002a7 "usize")
                  DW_AT_data_member_location	(0x00000004)

0x000008b9:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x000008c7:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000299 "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x000008d5:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000299 "u32")
                  DW_AT_data_member_location	(0x00000010)

0x000008e5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x0000090d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x0000091b:       NULL

0x0000091c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x00000944:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000952:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x000002a7 "usize")
                    DW_AT_location	(0x00000001)

0x00000969:       NULL

0x0000096a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x00000989:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000997:       NULL

0x00000998:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x000009b7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000009c5:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x000009d3:       NULL

0x000009d4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x000009f3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a01:       NULL

0x00000a02:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x00000a21:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a2f:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x00000299 "u32")
                    DW_AT_location	(0x00000001)

0x00000a3d:       NULL

0x00000a3e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x00000a5f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a6d:       NULL

0x00000a6e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x00000a8f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a9d:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x00000299 "u32")
                    DW_AT_location	(0x00000001)

0x00000aad:       NULL

0x00000aae:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x00000acd:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000adb:       NULL

0x00000adc:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00000afb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b09:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000b16:       NULL

0x00000b17:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x00000b37:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b45:       NULL

0x00000b46:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x00000b66:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b74:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000b83:       NULL

0x00000b84:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00000ba3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000bb1:       NULL

0x00000bb2:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00000bcf:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000bdd:       NULL

0x00000bde:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00000bfb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c09:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000c17:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000c2a:       NULL

0x00000c2b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x00000c53:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c61:       NULL

0x00000c62:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00000c81:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000888 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c8f:       NULL

0x00000c90:     NULL

0x00000c91:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x00000ca9:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000c91 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x00000cb7:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00000c91 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x00000cc5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x00000ce2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c91 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000cf0:       NULL

0x00000cf1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00000d0e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c91 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000d1c:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000c91 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000d2a:       NULL

0x00000d2b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x00000d48:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c91 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000d56:       NULL

0x00000d57:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x00000d74:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c91 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000d82:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00000c91 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000d90:       NULL

0x00000d91:     NULL

0x00000d92:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x00000da9:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x000002a7 "usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000db8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x00000dd5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d92 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000de3:       NULL

0x00000de4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00000e01:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d92 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000e0f:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x000002a7 "usize")
                    DW_AT_location	(0x00000001)

0x00000e1e:       NULL

0x00000e1f:     NULL

0x00000e20:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x00000e43:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000e52:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00000e7b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e20 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000e89:       NULL

0x00000e8a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x00000eb3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e20 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000ec1:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000ed0:       NULL

0x00000ed1:     NULL

0x00000ed2:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x00000eea:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x00000f05:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ed2 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00000f13:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000f20:       NULL

0x00000f21:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#get:length")

0x00000f40:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ed2 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00000f4e:       NULL

0x00000f4f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#concat")

0x00000f6a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ed2 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00000f78:       DW_TAG_formal_parameter
                    DW_AT_name	("other")
                    DW_AT_type	(0x00000ed2 "~lib/string/String")
                    DW_AT_location	(0x00000001)

0x00000f87:       NULL

0x00000f88:     NULL

0x00000f89:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000025 "i32")

0x00000faf:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_SHRINK_LEVEL")
                DW_AT_type	(0x00000025 "i32")

0x00000fd1:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x00000299 "u32")

0x00000fed:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x000002a7 "usize")

0x00001009:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x000002a7 "usize")

0x00001025:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x000002a7 "usize")

0x00001047:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x000002a7 "usize")

0x0000106a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x00000010 "bool")

0x00001084:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x000002a7 "usize")

0x000010a7:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x000002a7 "usize")

0x000010cb:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x00000010 "bool")

0x000010e7:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
