
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4


.debug_info contents:
0x00000000: Compile Unit: length = 0x00000a5e version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00000a62)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestGlobal/C1")
                DW_AT_signature	(0x00000004)

0x00000035:     DW_TAG_member
                  DW_AT_name	("a")
                  DW_AT_type	(0x00000107 "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x00000040:     NULL

0x00000041:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x00000063:     NULL

0x00000064:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x0000008a:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x00000041 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x0000009a:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x0000018f "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x000000ad:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000107 "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000008)

0x000000c1:     NULL

0x000000c2:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Bool")

0x000000d4:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F32")

0x000000e5:   DW_TAG_base_type
                DW_AT_name	("~lib/number/F64")

0x000000f6:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I16")

0x00000107:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I32")

0x00000118:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I64")

0x00000129:   DW_TAG_base_type
                DW_AT_name	("~lib/number/I8")

0x00000139:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Isize")

0x0000014c:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U16")

0x0000015d:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U32")

0x0000016e:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U64")

0x0000017f:   DW_TAG_base_type
                DW_AT_name	("~lib/number/U8")

0x0000018f:   DW_TAG_base_type
                DW_AT_name	("~lib/number/Usize")

0x000001a2:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x000001ba:     NULL

0x000001bb:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x000001d5:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x0000018f "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x000001e5:     NULL

0x000001e6:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x00000201:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x0000015d "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000004)

0x00000211:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x0000015d "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000008)

0x00000222:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000015d "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x00000230:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000015d "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x00000240:     NULL

0x00000241:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x0000025b:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x0000018f "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000272:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000241 "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x00000280:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000015d "~lib/number/U32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000028e:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000015d "~lib/number/U32")
                  DW_AT_data_member_location	(0x00000010)

0x0000029e:     NULL

0x0000029f:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x000002b7:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x0000029f "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x000002c5:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x0000029f "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x000002d3:     NULL

0x000002d4:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x000002eb:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x0000018f "~lib/number/Usize")
                  DW_AT_data_member_location	(0x00000000)

0x000002fa:     NULL

0x000002fb:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x0000031e:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000107 "~lib/number/I32")
                  DW_AT_data_member_location	(0x00000000)

0x0000032d:     NULL

0x0000032e:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x00000346:     NULL

0x00000347:   DW_TAG_variable
                DW_AT_name	("tests/DebugSymbol/TestGlobal/b")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x0000036b:   DW_TAG_variable
                DW_AT_name	("tests/DebugSymbol/TestGlobal/c1")
                DW_AT_type	(0x00000010 "tests/DebugSymbol/TestGlobal/C1")

0x00000390:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x000003b6:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x0000015d "~lib/number/U32")

0x000003d2:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x000003ee:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x0000040a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x0000042c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x0000044f:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x000000c2 "~lib/number/Bool")

0x00000469:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x0000048c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x000004b0:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x000000c2 "~lib/number/Bool")

0x000004cc:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x000000c2 "~lib/number/Bool")

0x000004e7:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x0000050a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x000000c2 "~lib/number/Bool")

0x00000524:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x00000542:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/GRANULARITY")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x00000561:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/IDLEFACTOR")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x0000057f:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_IDLE")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x0000059d:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_MARK")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x000005bb:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_SWEEP")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x000005da:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STEPFACTOR")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x000005f8:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/VISIT_SCAN")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x00000616:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/fromSpace")
                DW_AT_type	(0x00000241 "~lib/rt/itcms/Object")

0x00000633:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/gray")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x0000064b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/iter")
                DW_AT_type	(0x00000241 "~lib/rt/itcms/Object")

0x00000663:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/pinSpace")
                DW_AT_type	(0x00000241 "~lib/rt/itcms/Object")

0x0000067f:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/state")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x00000698:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/threshold")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x000006b5:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/toSpace")
                DW_AT_type	(0x00000241 "~lib/rt/itcms/Object")

0x000006d0:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/total")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x000006e9:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/transparent")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x00000708:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/visitCount")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x00000726:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/white")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x0000073f:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/BLOCK_MINSIZE")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x0000075f:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/FL_BITS")
                DW_AT_type	(0x0000015d "~lib/number/U32")

0x00000779:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/FREE")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x00000790:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/HL_END")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x000007a9:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/HL_START")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x000007c4:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/LEFTFREE")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x000007df:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/ROOT")
                DW_AT_type	(0x000002d4 "~lib/rt/tlsf/Root")

0x000007f6:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/ROOT_SIZE")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x00000812:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/SB_BITS")
                DW_AT_type	(0x0000015d "~lib/number/U32")

0x0000082c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/SB_SIZE")
                DW_AT_type	(0x0000015d "~lib/number/U32")

0x00000846:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/SL_BITS")
                DW_AT_type	(0x0000015d "~lib/number/U32")

0x00000860:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/SL_END")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x00000879:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/SL_SIZE")
                DW_AT_type	(0x0000015d "~lib/number/U32")

0x00000893:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/SL_START")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x000008ae:   DW_TAG_variable
                DW_AT_name	("~lib/rt/tlsf/TAGS_MASK")
                DW_AT_type	(0x0000018f "~lib/number/Usize")

0x000008ca:   DW_TAG_variable
                DW_AT_name	("~lib/util/error/E_ALLOCATION_TOO_LARGE")
                DW_AT_type	(0x0000032e "~lib/string/String")

0x000008f6:   DW_TAG_variable
                DW_AT_name	("~lib/util/error/E_INDEXOUTOFRANGE")
                DW_AT_type	(0x0000032e "~lib/string/String")

0x0000091d:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/EXP2F_TABLE_BITS")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x00000942:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/EXP_TABLE_BITS")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x00000965:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/LOG2F_TABLE_BITS")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x0000098a:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/LOG2_TABLE_BITS")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x000009ae:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/LOGF_TABLE_BITS")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x000009d2:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/LOG_TABLE_BITS")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x000009f5:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/POW_LOG_TABLE_BITS")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x00000a1c:   DW_TAG_variable
                DW_AT_name	("~lib/util/math/SIGN_BIAS")
                DW_AT_type	(0x00000107 "~lib/number/I32")

0x00000a3a:   DW_TAG_variable
                DW_AT_name	("~lib/util/number/MAX_DOUBLE_LENGTH")
                DW_AT_type	(0x00000107 "~lib/number/I32")

.debug_str contents:
0x00000000: "warpo"
