
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x00002796 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x0000279a)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_base_type
                DW_AT_name	("bool")

0x00000016:   DW_TAG_base_type
                DW_AT_name	("f32")

0x0000001b:   DW_TAG_base_type
                DW_AT_name	("f64")

0x00000020:   DW_TAG_base_type
                DW_AT_name	("i16")

0x00000025:   DW_TAG_base_type
                DW_AT_name	("i32")

0x0000002a:   DW_TAG_base_type
                DW_AT_name	("i64")

0x0000002f:   DW_TAG_base_type
                DW_AT_name	("i8")

0x00000033:   DW_TAG_base_type
                DW_AT_name	("isize")

0x0000003a:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestLambda/C")
                DW_AT_signature	(0x00000005)

0x0000005e:     DW_TAG_member
                  DW_AT_name	("f")
                  DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                  DW_AT_data_member_location	(0x00000000)

0x00000069:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestLambda/C#get:f")

0x0000008f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestLambda/C")
                    DW_AT_location	(0x00000000)

0x0000009d:       NULL

0x0000009e:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestLambda/C#set:f")

0x000000c4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestLambda/C")
                    DW_AT_location	(0x00000000)

0x000000d2:       DW_TAG_formal_parameter
                    DW_AT_name	("f")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000001)

0x000000dd:       NULL

0x000000de:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestLambda/C#constructor")

0x0000010a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestLambda/C")
                    DW_AT_location	(0x00000000)

0x00000118:       DW_TAG_formal_parameter
                    DW_AT_name	("f")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000001)

0x00000123:       NULL

0x00000124:     NULL

0x00000125:   DW_TAG_base_type
                DW_AT_name	("u16")

0x0000012a:   DW_TAG_base_type
                DW_AT_name	("u32")

0x0000012f:   DW_TAG_base_type
                DW_AT_name	("u64")

0x00000134:   DW_TAG_base_type
                DW_AT_name	("u8")

0x00000138:   DW_TAG_base_type
                DW_AT_name	("usize")

0x0000013f:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x00000161:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x0000018b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000013f "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x00000199:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000001a9:       NULL

0x000001aa:     NULL

0x000001ab:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x000001d1:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x0000013f "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x000001e1:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x00000138 "usize")
                  DW_AT_data_member_location	(0x00000004)

0x000001f4:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000008)

0x00000208:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x00000235:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000243:       NULL

0x00000244:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x00000271:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000027f:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x0000013f "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x0000028f:       NULL

0x00000290:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x000002c0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000002ce:       NULL

0x000002cf:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x000002ff:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000030d:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x00000138 "usize")
                    DW_AT_location	(0x00000001)

0x00000320:       NULL

0x00000321:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x00000352:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000360:       NULL

0x00000361:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x00000392:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003a0:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000003b4:       NULL

0x000003b5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x000003e3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003f1:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000401:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000414:       NULL

0x00000415:     NULL

0x00000416:   DW_TAG_class_type
                DW_AT_name	("~lib/function/Function<%28%29=>void>")
                DW_AT_signature	(0x00000004)

0x00000440:     DW_TAG_member
                  DW_AT_name	("_index")
                  DW_AT_type	(0x0000012a "u32")
                  DW_AT_data_member_location	(0x00000000)

0x00000450:     DW_TAG_member
                  DW_AT_name	("_env")
                  DW_AT_type	(0x00000138 "usize")
                  DW_AT_data_member_location	(0x00000004)

0x0000045e:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")

0x00000463:     DW_TAG_subprogram
                  DW_AT_name	("~lib/function/Function<()=>void>#get:_index")

0x00000490:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000000)

0x0000049e:       NULL

0x0000049f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/function/Function<()=>void>#set:_index")

0x000004cc:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000000)

0x000004da:       DW_TAG_formal_parameter
                    DW_AT_name	("_index")
                    DW_AT_type	(0x0000012a "u32")
                    DW_AT_location	(0x00000001)

0x000004ea:       NULL

0x000004eb:     DW_TAG_subprogram
                  DW_AT_name	("~lib/function/Function<()=>void>#get:_env")

0x00000516:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000000)

0x00000524:       NULL

0x00000525:     DW_TAG_subprogram
                  DW_AT_name	("~lib/function/Function<()=>void>#set:_env")

0x00000550:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000000)

0x0000055e:       DW_TAG_formal_parameter
                    DW_AT_name	("_env")
                    DW_AT_type	(0x00000138 "usize")
                    DW_AT_location	(0x00000001)

0x0000056c:       NULL

0x0000056d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/function/Function<()=>void>#__visit")

0x00000597:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000000)

0x000005a5:       DW_TAG_formal_parameter
                    DW_AT_name	("cookie")
                    DW_AT_type	(0x0000012a "u32")
                    DW_AT_location	(0x00000001)

0x000005b5:       NULL

0x000005b6:     NULL

0x000005b7:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x000005cf:     NULL

0x000005d0:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x000005ea:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x00000138 "usize")
                  DW_AT_data_member_location	(0x00000000)

0x000005fa:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x0000061b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000005d0 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000629:       NULL

0x0000062a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x0000064b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000005d0 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000659:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x00000138 "usize")
                    DW_AT_location	(0x00000001)

0x00000669:       NULL

0x0000066a:     NULL

0x0000066b:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x00000686:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x0000012a "u32")
                  DW_AT_data_member_location	(0x00000004)

0x00000696:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x0000012a "u32")
                  DW_AT_data_member_location	(0x00000008)

0x000006a7:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000012a "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x000006b5:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000012a "u32")
                  DW_AT_data_member_location	(0x00000010)

0x000006c5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x000006e7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000066b "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000006f5:       NULL

0x000006f6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x00000718:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000066b "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000726:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x0000012a "u32")
                    DW_AT_location	(0x00000001)

0x00000736:       NULL

0x00000737:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x0000075a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000066b "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000768:       NULL

0x00000769:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x0000078c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000066b "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000079a:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x0000012a "u32")
                    DW_AT_location	(0x00000001)

0x000007ab:       NULL

0x000007ac:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x000007cc:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000066b "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000007da:       NULL

0x000007db:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x000007fb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000066b "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000809:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x0000012a "u32")
                    DW_AT_location	(0x00000001)

0x00000817:       NULL

0x00000818:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x0000083a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000066b "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000848:       NULL

0x00000849:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x0000086b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000066b "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000879:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x0000012a "u32")
                    DW_AT_location	(0x00000001)

0x00000889:       NULL

0x0000088a:     NULL

0x0000088b:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x000008a5:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x00000138 "usize")
                  DW_AT_data_member_location	(0x00000004)

0x000008bc:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x000008ca:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000012a "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x000008d8:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000012a "u32")
                  DW_AT_data_member_location	(0x00000010)

0x000008e8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x00000910:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x0000091e:       NULL

0x0000091f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x00000947:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000955:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x00000138 "usize")
                    DW_AT_location	(0x00000001)

0x0000096c:       NULL

0x0000096d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x0000098c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x0000099a:       NULL

0x0000099b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x000009ba:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000009c8:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x000009d6:       NULL

0x000009d7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x000009f6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a04:       NULL

0x00000a05:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x00000a24:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a32:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x0000012a "u32")
                    DW_AT_location	(0x00000001)

0x00000a40:       NULL

0x00000a41:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x00000a62:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a70:       NULL

0x00000a71:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x00000a92:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000aa0:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x0000012a "u32")
                    DW_AT_location	(0x00000001)

0x00000ab0:       NULL

0x00000ab1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x00000ad1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000adf:       NULL

0x00000ae0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x00000b00:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b0e:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000b1d:       NULL

0x00000b1e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00000b3d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b4b:       NULL

0x00000b4c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00000b69:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b77:       NULL

0x00000b78:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x00000b97:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ba5:       NULL

0x00000ba6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00000bc5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000bd3:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000be0:       NULL

0x00000be1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00000bfe:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c0c:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000c1a:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000c2d:       NULL

0x00000c2e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x00000c56:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c64:       NULL

0x00000c65:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00000c84:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000088b "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c92:       NULL

0x00000c93:     NULL

0x00000c94:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x00000cac:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000c94 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x00000cba:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00000c94 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x00000cc8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x00000ce5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c94 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000cf3:       NULL

0x00000cf4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00000d11:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c94 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000d1f:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000c94 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000d2d:       NULL

0x00000d2e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x00000d4b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c94 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000d59:       NULL

0x00000d5a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x00000d77:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c94 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000d85:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00000c94 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000d93:       NULL

0x00000d94:     NULL

0x00000d95:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x00000dac:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x00000138 "usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000dbb:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x00000dd8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d95 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000de6:       NULL

0x00000de7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00000e04:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d95 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000e12:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x00000138 "usize")
                    DW_AT_location	(0x00000001)

0x00000e21:       NULL

0x00000e22:     NULL

0x00000e23:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x00000e46:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000e55:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00000e7e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e23 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000e8c:       NULL

0x00000e8d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x00000eb6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e23 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000ec4:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000ed3:       NULL

0x00000ed4:     NULL

0x00000ed5:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x00000eed:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x00000f08:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ed5 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00000f16:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000f23:       NULL

0x00000f24:     NULL

0x00000f25:   DW_TAG_variable
                DW_AT_name	("tests/DebugSymbol/TestLambda/c")
                DW_AT_type	(0x0000003a "tests/DebugSymbol/TestLambda/C")

0x00000f49:   DW_TAG_variable
                DW_AT_name	("tests/DebugSymbol/TestLambda/fn")
                DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")

0x00000f6e:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000025 "i32")

0x00000f94:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x0000012a "u32")

0x00000fb0:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x00000138 "usize")

0x00000fcc:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x00000138 "usize")

0x00000fe8:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x00000138 "usize")

0x0000100a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x00000138 "usize")

0x0000102d:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x00000010 "bool")

0x00001047:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x00000138 "usize")

0x0000106a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x00000138 "usize")

0x0000108e:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x00000010 "bool")

0x000010aa:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x00000010 "bool")

0x000010c5:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x00000138 "usize")

0x000010e8:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x00000010 "bool")

0x00001102:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x00000025 "i32")

0x00001120:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/GRANULARITY")
                DW_AT_type	(0x00000138 "usize")

0x0000113f:   DW_TAG_variable
