
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[9] DW_TAG_lexical_block	DW_CHILDREN_yes
	DW_AT_low_pc	DW_FORM_addr
	DW_AT_high_pc	DW_FORM_addr

[10] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x00002d89 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00002d8d)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_base_type
                DW_AT_name	("bool")

0x00000016:   DW_TAG_base_type
                DW_AT_name	("f32")

0x0000001b:   DW_TAG_base_type
                DW_AT_name	("f64")

0x00000020:   DW_TAG_base_type
                DW_AT_name	("i16")

0x00000025:   DW_TAG_base_type
                DW_AT_name	("i32")

0x0000002a:   DW_TAG_base_type
                DW_AT_name	("i64")

0x0000002f:   DW_TAG_base_type
                DW_AT_name	("i8")

0x00000033:   DW_TAG_base_type
                DW_AT_name	("isize")

0x0000003a:   DW_TAG_base_type
                DW_AT_name	("u16")

0x0000003f:   DW_TAG_base_type
                DW_AT_name	("u32")

0x00000044:   DW_TAG_base_type
                DW_AT_name	("u64")

0x00000049:   DW_TAG_base_type
                DW_AT_name	("u8")

0x0000004d:   DW_TAG_base_type
                DW_AT_name	("usize")

0x00000054:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1")
                DW_AT_signature	(0x00000004)

0x00000083:     DW_TAG_member
                  DW_AT_name	("x")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x0000008e:     DW_TAG_member
                  DW_AT_name	("y")
                  DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                  DW_AT_data_member_location	(0x00000004)

0x00000099:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#get:x")

0x000000ca:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x000000d8:       NULL

0x000000d9:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#set:x")

0x0000010a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x00000118:       DW_TAG_formal_parameter
                    DW_AT_name	("x")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000123:       NULL

0x00000124:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#get:y")

0x00000155:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x00000163:       NULL

0x00000164:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#set:y")

0x00000195:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x000001a3:       DW_TAG_formal_parameter
                    DW_AT_name	("y")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000001)

0x000001ae:       NULL

0x000001af:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#constructor")

0x000001e6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x000001f4:       NULL

0x000001f5:     NULL

0x000001f6:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                DW_AT_signature	(0x00000006)

0x0000022a:     DW_TAG_member
                  DW_AT_name	("a")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000235:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x00000025 "i32")

0x0000023a:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>#get:a")

0x00000270:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001f6 "tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                    DW_AT_location	(0x00000000)

0x0000027e:       NULL

0x0000027f:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>#set:a")

0x000002b5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001f6 "tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                    DW_AT_location	(0x00000000)

0x000002c3:       DW_TAG_formal_parameter
                    DW_AT_name	("a")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000002ce:       NULL

0x000002cf:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>#constructor")

0x0000030b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001f6 "tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                    DW_AT_location	(0x00000000)

0x00000319:       NULL

0x0000031a:     NULL

0x0000031b:   DW_TAG_class_type
                DW_AT_name	("~lib/array/Array<i32>")
                DW_AT_signature	(0x00000005)

0x00000336:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x000006a5 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x00000346:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000359:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000008)

0x0000036d:     DW_TAG_member
                  DW_AT_name	("length_")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000037e:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x00000025 "i32")

0x00000383:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#get:buffer")

0x000003a5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000003b3:       NULL

0x000003b4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#set:buffer")

0x000003d6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000003e4:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x000006a5 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x000003f4:       NULL

0x000003f5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#get:dataStart")

0x0000041a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000428:       NULL

0x00000429:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#set:dataStart")

0x0000044e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x0000045c:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x0000046f:       NULL

0x00000470:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#get:byteLength")

0x00000496:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000004a4:       NULL

0x000004a5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#set:byteLength")

0x000004cb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000004d9:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000004ed:       NULL

0x000004ee:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#get:length_")

0x00000511:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x0000051f:       NULL

0x00000520:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#set:length_")

0x00000543:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000551:       DW_TAG_formal_parameter
                    DW_AT_name	("length_")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000562:       NULL

0x00000563:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#constructor")

0x00000586:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000594:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000005a4:       NULL

0x000005a5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#__get")

0x000005c2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000005d0:       DW_TAG_formal_parameter
                    DW_AT_name	("index")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000005df:       NULL

0x000005e0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#__uget")

0x000005fe:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x0000060c:       DW_TAG_formal_parameter
                    DW_AT_name	("index")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x0000061b:       NULL

0x0000061c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#__set")

0x00000639:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000647:       DW_TAG_formal_parameter
                    DW_AT_name	("index")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000656:       DW_TAG_formal_parameter
                    DW_AT_name	("value")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000665:       NULL

0x00000666:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#__visit")

0x00000685:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000693:       DW_TAG_formal_parameter
                    DW_AT_name	("cookie")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x000006a3:       NULL

0x000006a4:     NULL

0x000006a5:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x000006c7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x000006f1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006a5 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x000006ff:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x0000070f:       NULL

0x00000710:     NULL

0x00000711:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x00000737:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x000006a5 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x00000747:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000004)

0x0000075a:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000008)

0x0000076e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x0000079b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000007a9:       NULL

0x000007aa:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x000007d7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000007e5:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x000006a5 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x000007f5:       NULL

0x000007f6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x00000826:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000834:       NULL

0x00000835:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x00000865:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000873:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000886:       NULL

0x00000887:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x000008b8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000008c6:       NULL

0x000008c7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x000008f8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000906:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x0000091a:       NULL

0x0000091b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x00000949:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000957:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000967:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x0000097a:       NULL

0x0000097b:     NULL

0x0000097c:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Bool")
                DW_AT_signature	(0x00000000)

0x00000992:     NULL

0x00000993:   DW_TAG_class_type
                DW_AT_name	("~lib/number/F32")
                DW_AT_signature	(0x00000000)

0x000009a8:     NULL

0x000009a9:   DW_TAG_class_type
                DW_AT_name	("~lib/number/F64")
                DW_AT_signature	(0x00000000)

0x000009be:     NULL

0x000009bf:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I16")
                DW_AT_signature	(0x00000000)

0x000009d4:     NULL

0x000009d5:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I32")
                DW_AT_signature	(0x00000000)

0x000009ea:     NULL

0x000009eb:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I64")
                DW_AT_signature	(0x00000000)

0x00000a00:     NULL

0x00000a01:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I8")
                DW_AT_signature	(0x00000000)

0x00000a15:     NULL

0x00000a16:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Isize")
                DW_AT_signature	(0x00000000)

0x00000a2d:     NULL

0x00000a2e:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U16")
                DW_AT_signature	(0x00000000)

0x00000a43:     NULL

0x00000a44:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U32")
                DW_AT_signature	(0x00000000)

0x00000a59:     NULL

0x00000a5a:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U64")
                DW_AT_signature	(0x00000000)

0x00000a6f:     NULL

0x00000a70:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U8")
                DW_AT_signature	(0x00000000)

0x00000a84:     NULL

0x00000a85:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Usize")
                DW_AT_signature	(0x00000000)

0x00000a9c:     NULL

0x00000a9d:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x00000ab5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/object/Object#constructor")

0x00000ad5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a9d "~lib/object/Object")
                    DW_AT_location	(0x00000000)

0x00000ae3:       NULL

0x00000ae4:     NULL

0x00000ae5:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x00000aff:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000b0f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x00000b30:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ae5 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000b3e:       NULL

0x00000b3f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x00000b60:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ae5 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000b6e:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000b7e:       NULL

0x00000b7f:     NULL

0x00000b80:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x00000b9b:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000004)

0x00000bab:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000008)

0x00000bbc:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x00000bca:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000010)

0x00000bda:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x00000bfc:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b80 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000c0a:       NULL

0x00000c0b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x00000c2d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b80 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000c3b:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000c4b:       NULL

0x00000c4c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x00000c6f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b80 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000c7d:       NULL

0x00000c7e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x00000ca1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b80 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000caf:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000cc0:       NULL

0x00000cc1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x00000ce1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b80 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000cef:       NULL

0x00000cf0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x00000d10:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b80 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000d1e:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000d2c:       NULL

0x00000d2d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x00000d4f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b80 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000d5d:       NULL

0x00000d5e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x00000d80:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b80 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000d8e:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000d9e:       NULL

0x00000d9f:     NULL

0x00000da0:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x00000dba:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000dd1:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x00000ddf:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x00000ded:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000010)

0x00000dfd:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x00000e25:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000e33:       NULL

0x00000e34:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x00000e5c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000e6a:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000e81:       NULL

0x00000e82:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x00000ea1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000eaf:       NULL

0x00000eb0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x00000ecf:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000edd:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000eeb:       NULL

0x00000eec:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x00000f0b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000f19:       NULL

0x00000f1a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x00000f39:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000f47:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000f55:       NULL

0x00000f56:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x00000f77:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000f85:       NULL

0x00000f86:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x00000fa7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000fb5:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000fc5:       NULL

0x00000fc6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x00000fe5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ff3:       NULL

0x00000ff4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00001013:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00001021:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x0000102e:       NULL

0x0000102f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x0000104f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x0000105d:       NULL

0x0000105e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x0000107e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x0000108c:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x0000109b:       NULL

0x0000109c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x000010bb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000010c9:       NULL

0x000010ca:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x000010e7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000010f5:       NULL

0x000010f6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00001113:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00001121:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x0000112f:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00001142:       NULL

0x00001143:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x0000116b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00001179:       NULL

0x0000117a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00001199:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da0 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000011a7:       NULL

0x000011a8:     NULL

0x000011a9:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x000011c1:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x000011a9 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x000011cf:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x000011a9 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x000011dd:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x000011fa:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000011a9 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00001208:       NULL

0x00001209:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00001226:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000011a9 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00001234:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x000011a9 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00001242:       NULL

0x00001243:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x00001260:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000011a9 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x0000126e:       NULL

0x0000126f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x0000128c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000011a9 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x0000129a:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x000011a9 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x000012a8:       NULL

0x000012a9:     NULL

0x000012aa:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x000012c1:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000000)

0x000012d0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x000012ed:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000012aa "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x000012fb:       NULL

0x000012fc:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00001319:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000012aa "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00001327:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00001336:       NULL

0x00001337:     NULL

0x00001338:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x0000135b:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x0000136a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00001393:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001338 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x000013a1:       NULL

0x000013a2:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x000013cb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001338 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x000013d9:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000013e8:       NULL

0x000013e9:     NULL

0x000013ea:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x00001402:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x0000141d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000013ea "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x0000142b:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00001438:       NULL

0x00001439:     NULL

0x0000143a:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000025 "i32")

0x00001460:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x0000003f "u32")

0x0000147c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x0000004d "usize")

0x00001498:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x0000004d "usize")

0x000014b4:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x0000004d "usize")

0x000014d6:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x000014f9:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x00000010 "bool")

0x00001513:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x0000004d "usize")

0x00001536:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x0000155a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x00000010 "bool")

0x00001576:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x00000010 "bool")

0x00001591:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x000015b4:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x00000010 "bool")

0x000015ce:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x00000025 "i32")

0x000015ec:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/GRANULARITY")
                DW_AT_type	(0x0000004d "usize")

0x0000160b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/IDLEFACTOR")
                DW_AT_type	(0x0000004d "usize")

0x00001629:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_IDLE")
                DW_AT_type	(0x00000025 "i32")

0x00001647:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_MARK")
                DW_AT_type	(0x00000025 "i32")

