
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[9] DW_TAG_lexical_block	DW_CHILDREN_yes
	DW_AT_low_pc	DW_FORM_addr
	DW_AT_high_pc	DW_FORM_addr

[10] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x000028b7 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x000028bb)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_base_type
                DW_AT_name	("bool")

0x00000016:   DW_TAG_base_type
                DW_AT_name	("f32")

0x0000001b:   DW_TAG_base_type
                DW_AT_name	("f64")

0x00000020:   DW_TAG_base_type
                DW_AT_name	("i16")

0x00000025:   DW_TAG_base_type
                DW_AT_name	("i32")

0x0000002a:   DW_TAG_base_type
                DW_AT_name	("i64")

0x0000002f:   DW_TAG_base_type
                DW_AT_name	("i8")

0x00000033:   DW_TAG_base_type
                DW_AT_name	("isize")

0x0000003a:   DW_TAG_base_type
                DW_AT_name	("u16")

0x0000003f:   DW_TAG_base_type
                DW_AT_name	("u32")

0x00000044:   DW_TAG_base_type
                DW_AT_name	("u64")

0x00000049:   DW_TAG_base_type
                DW_AT_name	("u8")

0x0000004d:   DW_TAG_base_type
                DW_AT_name	("usize")

0x00000054:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestLambda/C")
                DW_AT_signature	(0x00000005)

0x00000078:     DW_TAG_member
                  DW_AT_name	("f")
                  DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                  DW_AT_data_member_location	(0x00000000)

0x00000083:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestLambda/C#get:f")

0x000000a9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestLambda/C")
                    DW_AT_location	(0x00000000)

0x000000b7:       NULL

0x000000b8:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestLambda/C#set:f")

0x000000de:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestLambda/C")
                    DW_AT_location	(0x00000000)

0x000000ec:       DW_TAG_formal_parameter
                    DW_AT_name	("f")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000001)

0x000000f7:       NULL

0x000000f8:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestLambda/C#constructor")

0x00000124:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestLambda/C")
                    DW_AT_location	(0x00000000)

0x00000132:       DW_TAG_formal_parameter
                    DW_AT_name	("f")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000001)

0x0000013d:       NULL

0x0000013e:     NULL

0x0000013f:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x00000161:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x0000018b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000013f "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x00000199:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000001a9:       NULL

0x000001aa:     NULL

0x000001ab:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x000001d1:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x0000013f "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x000001e1:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000004)

0x000001f4:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000008)

0x00000208:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x00000235:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000243:       NULL

0x00000244:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x00000271:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000027f:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x0000013f "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x0000028f:       NULL

0x00000290:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x000002c0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000002ce:       NULL

0x000002cf:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x000002ff:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000030d:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000320:       NULL

0x00000321:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x00000352:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000360:       NULL

0x00000361:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x00000392:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003a0:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000003b4:       NULL

0x000003b5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x000003e3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001ab "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003f1:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000401:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000414:       NULL

0x00000415:     NULL

0x00000416:   DW_TAG_class_type
                DW_AT_name	("~lib/function/Function<%28%29=>void>")
                DW_AT_signature	(0x00000004)

0x00000440:     DW_TAG_member
                  DW_AT_name	("_index")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000000)

0x00000450:     DW_TAG_member
                  DW_AT_name	("_env")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000004)

0x0000045e:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")

0x00000463:     DW_TAG_subprogram
                  DW_AT_name	("~lib/function/Function<()=>void>#get:_index")

0x00000490:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000000)

0x0000049e:       NULL

0x0000049f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/function/Function<()=>void>#set:_index")

0x000004cc:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000000)

0x000004da:       DW_TAG_formal_parameter
                    DW_AT_name	("_index")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x000004ea:       NULL

0x000004eb:     DW_TAG_subprogram
                  DW_AT_name	("~lib/function/Function<()=>void>#get:_env")

0x00000516:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000000)

0x00000524:       NULL

0x00000525:     DW_TAG_subprogram
                  DW_AT_name	("~lib/function/Function<()=>void>#set:_env")

0x00000550:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000000)

0x0000055e:       DW_TAG_formal_parameter
                    DW_AT_name	("_env")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x0000056c:       NULL

0x0000056d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/function/Function<()=>void>#__visit")

0x00000597:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")
                    DW_AT_location	(0x00000000)

0x000005a5:       DW_TAG_formal_parameter
                    DW_AT_name	("cookie")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x000005b5:       NULL

0x000005b6:     NULL

0x000005b7:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Bool")
                DW_AT_signature	(0x00000000)

0x000005cd:     NULL

0x000005ce:   DW_TAG_class_type
                DW_AT_name	("~lib/number/F32")
                DW_AT_signature	(0x00000000)

0x000005e3:     NULL

0x000005e4:   DW_TAG_class_type
                DW_AT_name	("~lib/number/F64")
                DW_AT_signature	(0x00000000)

0x000005f9:     NULL

0x000005fa:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I16")
                DW_AT_signature	(0x00000000)

0x0000060f:     NULL

0x00000610:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I32")
                DW_AT_signature	(0x00000000)

0x00000625:     NULL

0x00000626:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I64")
                DW_AT_signature	(0x00000000)

0x0000063b:     NULL

0x0000063c:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I8")
                DW_AT_signature	(0x00000000)

0x00000650:     NULL

0x00000651:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Isize")
                DW_AT_signature	(0x00000000)

0x00000668:     NULL

0x00000669:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U16")
                DW_AT_signature	(0x00000000)

0x0000067e:     NULL

0x0000067f:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U32")
                DW_AT_signature	(0x00000000)

0x00000694:     NULL

0x00000695:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U64")
                DW_AT_signature	(0x00000000)

0x000006aa:     NULL

0x000006ab:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U8")
                DW_AT_signature	(0x00000000)

0x000006bf:     NULL

0x000006c0:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Usize")
                DW_AT_signature	(0x00000000)

0x000006d7:     NULL

0x000006d8:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x000006f0:     NULL

0x000006f1:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x0000070b:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000000)

0x0000071b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x0000073c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006f1 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x0000074a:       NULL

0x0000074b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x0000076c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006f1 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x0000077a:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x0000078a:       NULL

0x0000078b:     NULL

0x0000078c:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x000007a7:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000004)

0x000007b7:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000008)

0x000007c8:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x000007d6:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000010)

0x000007e6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x00000808:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000078c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000816:       NULL

0x00000817:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x00000839:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000078c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000847:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000857:       NULL

0x00000858:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x0000087b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000078c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000889:       NULL

0x0000088a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x000008ad:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000078c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000008bb:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x000008cc:       NULL

0x000008cd:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x000008ed:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000078c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000008fb:       NULL

0x000008fc:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x0000091c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000078c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000092a:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000938:       NULL

0x00000939:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x0000095b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000078c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000969:       NULL

0x0000096a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x0000098c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000078c "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000099a:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x000009aa:       NULL

0x000009ab:     NULL

0x000009ac:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x000009c6:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000004)

0x000009dd:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x000009eb:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x000009f9:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000010)

0x00000a09:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x00000a31:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a3f:       NULL

0x00000a40:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x00000a68:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a76:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000a8d:       NULL

0x00000a8e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x00000aad:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000abb:       NULL

0x00000abc:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x00000adb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ae9:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000af7:       NULL

0x00000af8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x00000b17:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b25:       NULL

0x00000b26:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x00000b45:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b53:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000b61:       NULL

0x00000b62:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x00000b83:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b91:       NULL

0x00000b92:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x00000bb3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000bc1:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000bd1:       NULL

0x00000bd2:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x00000bf2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c00:       NULL

0x00000c01:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x00000c21:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c2f:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000c3e:       NULL

0x00000c3f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00000c5e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c6c:       NULL

0x00000c6d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00000c8a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c98:       NULL

0x00000c99:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x00000cb8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000cc6:       NULL

0x00000cc7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00000ce6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000cf4:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000d01:       NULL

0x00000d02:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00000d1f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d2d:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000d3b:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000d4e:       NULL

0x00000d4f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x00000d77:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d85:       NULL

0x00000d86:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00000da5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009ac "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000db3:       NULL

0x00000db4:     NULL

0x00000db5:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x00000dcd:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000db5 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x00000ddb:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00000db5 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x00000de9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x00000e06:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000db5 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000e14:       NULL

0x00000e15:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00000e32:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000db5 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000e40:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000db5 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000e4e:       NULL

0x00000e4f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x00000e6c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000db5 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000e7a:       NULL

0x00000e7b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x00000e98:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000db5 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000ea6:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00000db5 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000eb4:       NULL

0x00000eb5:     NULL

0x00000eb6:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x00000ecd:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000edc:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x00000ef9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000eb6 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000f07:       NULL

0x00000f08:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00000f25:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000eb6 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000f33:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000f42:       NULL

0x00000f43:     NULL

0x00000f44:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x00000f67:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000f76:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00000f9f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000f44 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000fad:       NULL

0x00000fae:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x00000fd7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000f44 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000fe5:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000ff4:       NULL

0x00000ff5:     NULL

0x00000ff6:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x0000100e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x00001029:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ff6 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00001037:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00001044:       NULL

0x00001045:     NULL

0x00001046:   DW_TAG_variable
                DW_AT_name	("tests/DebugSymbol/TestLambda/c")
                DW_AT_type	(0x00000054 "tests/DebugSymbol/TestLambda/C")

0x0000106a:   DW_TAG_variable
                DW_AT_name	("tests/DebugSymbol/TestLambda/fn")
                DW_AT_type	(0x00000416 "~lib/function/Function<%28%29=>void>")

0x0000108f:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000025 "i32")

0x000010b5:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x0000003f "u32")

0x000010d1:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x0000004d "usize")

0x000010ed:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x0000004d "usize")

0x00001109:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x0000004d "usize")

0x0000112b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x0000114e:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x00000010 "bool")

0x00001168:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x0000004d "usize")

0x0000118b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x000011af:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x00000010 "bool")

0x000011cb:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x00000010 "bool")

0x000011e6:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x00001209:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x00000010 "bool")

0x00001223:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x00000025 "i32")

0x00001241:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/GRANULARITY")
                DW_AT_type	(0x0000004d "usize")

0x00001260:   DW_TAG_variable
