
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x000025a6 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x000025aa)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_base_type
                DW_AT_name	("bool")

0x00000016:   DW_TAG_base_type
                DW_AT_name	("f32")

0x0000001b:   DW_TAG_base_type
                DW_AT_name	("f64")

0x00000020:   DW_TAG_base_type
                DW_AT_name	("i16")

0x00000025:   DW_TAG_base_type
                DW_AT_name	("i32")

0x0000002a:   DW_TAG_base_type
                DW_AT_name	("i64")

0x0000002f:   DW_TAG_base_type
                DW_AT_name	("i8")

0x00000033:   DW_TAG_base_type
                DW_AT_name	("isize")

0x0000003a:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestGlobal/C1")
                DW_AT_signature	(0x00000004)

0x0000005f:     DW_TAG_member
                  DW_AT_name	("a")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x0000006a:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestGlobal/C1#get:a")

0x00000091:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestGlobal/C1")
                    DW_AT_location	(0x00000000)

0x0000009f:       NULL

0x000000a0:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestGlobal/C1#set:a")

0x000000c7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestGlobal/C1")
                    DW_AT_location	(0x00000000)

0x000000d5:       DW_TAG_formal_parameter
                    DW_AT_name	("a")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000000e0:       NULL

0x000000e1:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestGlobal/C1#constructor")

0x0000010e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestGlobal/C1")
                    DW_AT_location	(0x00000000)

0x0000011c:       NULL

0x0000011d:     NULL

0x0000011e:   DW_TAG_base_type
                DW_AT_name	("u16")

0x00000123:   DW_TAG_base_type
                DW_AT_name	("u32")

0x00000128:   DW_TAG_base_type
                DW_AT_name	("u64")

0x0000012d:   DW_TAG_base_type
                DW_AT_name	("u8")

0x00000131:   DW_TAG_base_type
                DW_AT_name	("usize")

0x00000138:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x0000015a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x00000184:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000138 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x00000192:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000001a2:       NULL

0x000001a3:     NULL

0x000001a4:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x000001ca:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x00000138 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x000001da:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x00000131 "usize")
                  DW_AT_data_member_location	(0x00000004)

0x000001ed:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000008)

0x00000201:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x0000022e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001a4 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000023c:       NULL

0x0000023d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x0000026a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001a4 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000278:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x00000138 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x00000288:       NULL

0x00000289:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x000002b9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001a4 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000002c7:       NULL

0x000002c8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x000002f8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001a4 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000306:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x00000131 "usize")
                    DW_AT_location	(0x00000001)

0x00000319:       NULL

0x0000031a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x0000034b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001a4 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000359:       NULL

0x0000035a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x0000038b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001a4 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000399:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000003ad:       NULL

0x000003ae:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x000003dc:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001a4 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003ea:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000003fa:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x0000040d:       NULL

0x0000040e:     NULL

0x0000040f:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x00000427:     DW_TAG_subprogram
                  DW_AT_name	("~lib/object/Object#constructor")

0x00000447:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000040f "~lib/object/Object")
                    DW_AT_location	(0x00000000)

0x00000455:       NULL

0x00000456:     NULL

0x00000457:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x00000471:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x00000131 "usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000481:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x000004a2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000457 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x000004b0:       NULL

0x000004b1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x000004d2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000457 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x000004e0:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x00000131 "usize")
                    DW_AT_location	(0x00000001)

0x000004f0:       NULL

0x000004f1:     NULL

0x000004f2:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x0000050d:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x00000123 "u32")
                  DW_AT_data_member_location	(0x00000004)

0x0000051d:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x00000123 "u32")
                  DW_AT_data_member_location	(0x00000008)

0x0000052e:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000123 "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000053c:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000123 "u32")
                  DW_AT_data_member_location	(0x00000010)

0x0000054c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x0000056e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000004f2 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000057c:       NULL

0x0000057d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x0000059f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000004f2 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000005ad:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x00000123 "u32")
                    DW_AT_location	(0x00000001)

0x000005bd:       NULL

0x000005be:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x000005e1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000004f2 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000005ef:       NULL

0x000005f0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x00000613:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000004f2 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000621:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x00000123 "u32")
                    DW_AT_location	(0x00000001)

0x00000632:       NULL

0x00000633:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x00000653:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000004f2 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000661:       NULL

0x00000662:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x00000682:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000004f2 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000690:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x00000123 "u32")
                    DW_AT_location	(0x00000001)

0x0000069e:       NULL

0x0000069f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x000006c1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000004f2 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000006cf:       NULL

0x000006d0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x000006f2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000004f2 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000700:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x00000123 "u32")
                    DW_AT_location	(0x00000001)

0x00000710:       NULL

0x00000711:     NULL

0x00000712:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x0000072c:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x00000131 "usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000743:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x00000751:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000123 "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000075f:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000123 "u32")
                  DW_AT_data_member_location	(0x00000010)

0x0000076f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x00000797:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000007a5:       NULL

0x000007a6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x000007ce:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000007dc:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x00000131 "usize")
                    DW_AT_location	(0x00000001)

0x000007f3:       NULL

0x000007f4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x00000813:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000821:       NULL

0x00000822:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x00000841:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x0000084f:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x0000085d:       NULL

0x0000085e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x0000087d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x0000088b:       NULL

0x0000088c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x000008ab:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000008b9:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x00000123 "u32")
                    DW_AT_location	(0x00000001)

0x000008c7:       NULL

0x000008c8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x000008e9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000008f7:       NULL

0x000008f8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x00000919:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000927:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x00000123 "u32")
                    DW_AT_location	(0x00000001)

0x00000937:       NULL

0x00000938:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x00000957:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000965:       NULL

0x00000966:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00000985:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000993:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x000009a0:       NULL

0x000009a1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x000009c1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000009cf:       NULL

0x000009d0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x000009f0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000009fe:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000a0d:       NULL

0x00000a0e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00000a2d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a3b:       NULL

0x00000a3c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00000a59:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a67:       NULL

0x00000a68:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00000a85:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a93:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000aa1:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000ab4:       NULL

0x00000ab5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x00000add:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000aeb:       NULL

0x00000aec:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00000b0b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000712 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b19:       NULL

0x00000b1a:     NULL

0x00000b1b:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x00000b33:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000b1b "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x00000b41:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00000b1b "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x00000b4f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x00000b6c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b1b "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000b7a:       NULL

0x00000b7b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00000b98:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b1b "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000ba6:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000b1b "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000bb4:       NULL

0x00000bb5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x00000bd2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b1b "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000be0:       NULL

0x00000be1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x00000bfe:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b1b "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000c0c:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00000b1b "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000c1a:       NULL

0x00000c1b:     NULL

0x00000c1c:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x00000c33:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x00000131 "usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000c42:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x00000c5f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c1c "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000c6d:       NULL

0x00000c6e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00000c8b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c1c "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000c99:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x00000131 "usize")
                    DW_AT_location	(0x00000001)

0x00000ca8:       NULL

0x00000ca9:     NULL

0x00000caa:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x00000ccd:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000cdc:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00000d05:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000caa "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000d13:       NULL

0x00000d14:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x00000d3d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000caa "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000d4b:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000d5a:       NULL

0x00000d5b:     NULL

0x00000d5c:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x00000d74:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x00000d8f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d5c "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00000d9d:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000daa:       NULL

0x00000dab:     NULL

0x00000dac:   DW_TAG_variable
                DW_AT_name	("tests/DebugSymbol/TestGlobal/b")
                DW_AT_type	(0x00000025 "i32")

0x00000dd0:   DW_TAG_variable
                DW_AT_name	("tests/DebugSymbol/TestGlobal/c1")
                DW_AT_type	(0x0000003a "tests/DebugSymbol/TestGlobal/C1")

0x00000df5:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000025 "i32")

0x00000e1b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x00000123 "u32")

0x00000e37:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x00000131 "usize")

0x00000e53:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x00000131 "usize")

0x00000e6f:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x00000131 "usize")

0x00000e91:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x00000131 "usize")

0x00000eb4:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x00000010 "bool")

0x00000ece:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x00000131 "usize")

0x00000ef1:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x00000131 "usize")

0x00000f15:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x00000010 "bool")

0x00000f31:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x00000010 "bool")

0x00000f4c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x00000131 "usize")

0x00000f6f:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x00000010 "bool")

0x00000f89:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x00000025 "i32")

0x00000fa7:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/GRANULARITY")
                DW_AT_type	(0x00000131 "usize")

0x00000fc6:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/IDLEFACTOR")
