
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x00002767 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x0000276b)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_base_type
                DW_AT_name	("bool")

0x00000016:   DW_TAG_base_type
                DW_AT_name	("f32")

0x0000001b:   DW_TAG_base_type
                DW_AT_name	("f64")

0x00000020:   DW_TAG_base_type
                DW_AT_name	("i16")

0x00000025:   DW_TAG_base_type
                DW_AT_name	("i32")

0x0000002a:   DW_TAG_base_type
                DW_AT_name	("i64")

0x0000002f:   DW_TAG_base_type
                DW_AT_name	("i8")

0x00000033:   DW_TAG_base_type
                DW_AT_name	("isize")

0x0000003a:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>")
                DW_AT_signature	(0x00000004)

0x0000006b:     DW_TAG_member
                  DW_AT_name	("a")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000076:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x00000025 "i32")

0x0000007b:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>#get:a")

0x000000ae:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                    DW_AT_location	(0x00000000)

0x000000bc:       NULL

0x000000bd:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>#set:a")

0x000000f0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                    DW_AT_location	(0x00000000)

0x000000fe:       DW_TAG_formal_parameter
                    DW_AT_name	("a")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000109:       NULL

0x0000010a:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>#constructor")

0x00000143:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                    DW_AT_location	(0x00000000)

0x00000151:       NULL

0x00000152:     NULL

0x00000153:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                DW_AT_signature	(0x00000005)

0x000001ac:     DW_TAG_member
                  DW_AT_name	("b")
                  DW_AT_type	(0x0000003a "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                  DW_AT_data_member_location	(0x00000000)

0x000001b7:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x0000003a "tests/DebugSymbol/TestTemplateClass/C2<i32>")

0x000001bc:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>#get:b")

0x00000217:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000153 "tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                    DW_AT_location	(0x00000000)

0x00000225:       NULL

0x00000226:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>#set:b")

0x00000281:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000153 "tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                    DW_AT_location	(0x00000000)

0x0000028f:       DW_TAG_formal_parameter
                    DW_AT_name	("b")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                    DW_AT_location	(0x00000001)

0x0000029a:       NULL

0x0000029b:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>#constructor")

0x000002fc:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000153 "tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                    DW_AT_location	(0x00000000)

0x0000030a:       NULL

0x0000030b:     NULL

0x0000030c:   DW_TAG_base_type
                DW_AT_name	("u16")

0x00000311:   DW_TAG_base_type
                DW_AT_name	("u32")

0x00000316:   DW_TAG_base_type
                DW_AT_name	("u64")

0x0000031b:   DW_TAG_base_type
                DW_AT_name	("u8")

0x0000031f:   DW_TAG_base_type
                DW_AT_name	("usize")

0x00000326:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x00000348:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x00000372:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000326 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x00000380:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000390:       NULL

0x00000391:     NULL

0x00000392:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x000003b8:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x00000326 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x000003c8:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x0000031f "usize")
                  DW_AT_data_member_location	(0x00000004)

0x000003db:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000008)

0x000003ef:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x0000041c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000042a:       NULL

0x0000042b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x00000458:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000466:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x00000326 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x00000476:       NULL

0x00000477:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x000004a7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000004b5:       NULL

0x000004b6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x000004e6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000004f4:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x0000031f "usize")
                    DW_AT_location	(0x00000001)

0x00000507:       NULL

0x00000508:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x00000539:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000547:       NULL

0x00000548:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x00000579:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000587:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x0000059b:       NULL

0x0000059c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x000005ca:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000005d8:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000005e8:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x000005fb:       NULL

0x000005fc:     NULL

0x000005fd:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x00000615:     DW_TAG_subprogram
                  DW_AT_name	("~lib/object/Object#constructor")

0x00000635:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000005fd "~lib/object/Object")
                    DW_AT_location	(0x00000000)

0x00000643:       NULL

0x00000644:     NULL

0x00000645:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x0000065f:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x0000031f "usize")
                  DW_AT_data_member_location	(0x00000000)

0x0000066f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x00000690:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000645 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x0000069e:       NULL

0x0000069f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x000006c0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000645 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x000006ce:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x0000031f "usize")
                    DW_AT_location	(0x00000001)

0x000006de:       NULL

0x000006df:     NULL

0x000006e0:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x000006fb:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x00000311 "u32")
                  DW_AT_data_member_location	(0x00000004)

0x0000070b:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x00000311 "u32")
                  DW_AT_data_member_location	(0x00000008)

0x0000071c:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000311 "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000072a:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000311 "u32")
                  DW_AT_data_member_location	(0x00000010)

0x0000073a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x0000075c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006e0 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000076a:       NULL

0x0000076b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x0000078d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006e0 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000079b:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x00000311 "u32")
                    DW_AT_location	(0x00000001)

0x000007ab:       NULL

0x000007ac:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x000007cf:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006e0 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000007dd:       NULL

0x000007de:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x00000801:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006e0 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000080f:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x00000311 "u32")
                    DW_AT_location	(0x00000001)

0x00000820:       NULL

0x00000821:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x00000841:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006e0 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000084f:       NULL

0x00000850:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x00000870:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006e0 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000087e:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x00000311 "u32")
                    DW_AT_location	(0x00000001)

0x0000088c:       NULL

0x0000088d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x000008af:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006e0 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000008bd:       NULL

0x000008be:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x000008e0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006e0 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000008ee:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x00000311 "u32")
                    DW_AT_location	(0x00000001)

0x000008fe:       NULL

0x000008ff:     NULL

0x00000900:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x0000091a:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x0000031f "usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000931:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x0000093f:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000311 "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000094d:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000311 "u32")
                  DW_AT_data_member_location	(0x00000010)

0x0000095d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x00000985:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000993:       NULL

0x00000994:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x000009bc:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000009ca:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x0000031f "usize")
                    DW_AT_location	(0x00000001)

0x000009e1:       NULL

0x000009e2:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x00000a01:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a0f:       NULL

0x00000a10:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x00000a2f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a3d:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000a4b:       NULL

0x00000a4c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x00000a6b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a79:       NULL

0x00000a7a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x00000a99:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000aa7:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x00000311 "u32")
                    DW_AT_location	(0x00000001)

0x00000ab5:       NULL

0x00000ab6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x00000ad7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ae5:       NULL

0x00000ae6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x00000b07:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b15:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x00000311 "u32")
                    DW_AT_location	(0x00000001)

0x00000b25:       NULL

0x00000b26:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x00000b45:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b53:       NULL

0x00000b54:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00000b73:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b81:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000b8e:       NULL

0x00000b8f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x00000baf:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000bbd:       NULL

0x00000bbe:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x00000bde:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000bec:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000bfb:       NULL

0x00000bfc:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00000c1b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c29:       NULL

0x00000c2a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00000c47:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c55:       NULL

0x00000c56:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00000c73:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c81:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000c8f:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000ca2:       NULL

0x00000ca3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x00000ccb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000cd9:       NULL

0x00000cda:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00000cf9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000900 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d07:       NULL

0x00000d08:     NULL

0x00000d09:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x00000d21:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000d09 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x00000d2f:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00000d09 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x00000d3d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x00000d5a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d09 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000d68:       NULL

0x00000d69:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00000d86:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d09 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000d94:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000d09 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000da2:       NULL

0x00000da3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x00000dc0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d09 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000dce:       NULL

0x00000dcf:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x00000dec:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000d09 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000dfa:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00000d09 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000e08:       NULL

0x00000e09:     NULL

0x00000e0a:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x00000e21:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x0000031f "usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000e30:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x00000e4d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e0a "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000e5b:       NULL

0x00000e5c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00000e79:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e0a "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000e87:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x0000031f "usize")
                    DW_AT_location	(0x00000001)

0x00000e96:       NULL

0x00000e97:     NULL

0x00000e98:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x00000ebb:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000eca:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00000ef3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e98 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000f01:       NULL

0x00000f02:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x00000f2b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e98 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000f39:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000f48:       NULL

0x00000f49:     NULL

0x00000f4a:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x00000f62:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x00000f7d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000f4a "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00000f8b:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000f98:       NULL

0x00000f99:     NULL

0x00000f9a:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000025 "i32")

0x00000fc0:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x00000311 "u32")

0x00000fdc:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x0000031f "usize")

0x00000ff8:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x0000031f "usize")

0x00001014:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x0000031f "usize")

0x00001036:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x0000031f "usize")

0x00001059:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x00000010 "bool")

0x00001073:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x0000031f "usize")

0x00001096:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x0000031f "usize")

0x000010ba:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x00000010 "bool")

0x000010d6:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x00000010 "bool")

0x000010f1:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x0000031f "usize")

0x00001114:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x00000010 "bool")

0x0000112e:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x00000025 "i32")

0x0000114c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/GRANULARITY")
                DW_AT_type	(0x0000031f "usize")

0x0000116b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/IDLEFACTOR")
                DW_AT_type	(0x0000031f "usize")

0x00001189:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_IDLE")
                DW_AT_type	(0x00000025 "i32")

0x000011a7:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_MARK")
                DW_AT_type	(0x00000025 "i32")

