
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[9] DW_TAG_lexical_block	DW_CHILDREN_yes
	DW_AT_low_pc	DW_FORM_addr
	DW_AT_high_pc	DW_FORM_addr

[10] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x00002888 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x0000288c)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_base_type
                DW_AT_name	("bool")

0x00000016:   DW_TAG_base_type
                DW_AT_name	("f32")

0x0000001b:   DW_TAG_base_type
                DW_AT_name	("f64")

0x00000020:   DW_TAG_base_type
                DW_AT_name	("i16")

0x00000025:   DW_TAG_base_type
                DW_AT_name	("i32")

0x0000002a:   DW_TAG_base_type
                DW_AT_name	("i64")

0x0000002f:   DW_TAG_base_type
                DW_AT_name	("i8")

0x00000033:   DW_TAG_base_type
                DW_AT_name	("isize")

0x0000003a:   DW_TAG_base_type
                DW_AT_name	("u16")

0x0000003f:   DW_TAG_base_type
                DW_AT_name	("u32")

0x00000044:   DW_TAG_base_type
                DW_AT_name	("u64")

0x00000049:   DW_TAG_base_type
                DW_AT_name	("u8")

0x0000004d:   DW_TAG_base_type
                DW_AT_name	("usize")

0x00000054:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>")
                DW_AT_signature	(0x00000004)

0x00000085:     DW_TAG_member
                  DW_AT_name	("a")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000090:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x00000025 "i32")

0x00000095:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>#get:a")

0x000000c8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                    DW_AT_location	(0x00000000)

0x000000d6:       NULL

0x000000d7:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>#set:a")

0x0000010a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                    DW_AT_location	(0x00000000)

0x00000118:       DW_TAG_formal_parameter
                    DW_AT_name	("a")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000123:       NULL

0x00000124:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C2<i32>#constructor")

0x0000015d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                    DW_AT_location	(0x00000000)

0x0000016b:       NULL

0x0000016c:     NULL

0x0000016d:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                DW_AT_signature	(0x00000005)

0x000001c6:     DW_TAG_member
                  DW_AT_name	("b")
                  DW_AT_type	(0x00000054 "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                  DW_AT_data_member_location	(0x00000000)

0x000001d1:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x00000054 "tests/DebugSymbol/TestTemplateClass/C2<i32>")

0x000001d6:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>#get:b")

0x00000231:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000016d "tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                    DW_AT_location	(0x00000000)

0x0000023f:       NULL

0x00000240:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>#set:b")

0x0000029b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000016d "tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                    DW_AT_location	(0x00000000)

0x000002a9:       DW_TAG_formal_parameter
                    DW_AT_name	("b")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestTemplateClass/C2<i32>")
                    DW_AT_location	(0x00000001)

0x000002b4:       NULL

0x000002b5:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>#constructor")

0x00000316:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000016d "tests/DebugSymbol/TestTemplateClass/C3<tests/DebugSymbol/TestTemplateClass/C2<i32>>")
                    DW_AT_location	(0x00000000)

0x00000324:       NULL

0x00000325:     NULL

0x00000326:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x00000348:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x00000372:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000326 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x00000380:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000390:       NULL

0x00000391:     NULL

0x00000392:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x000003b8:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x00000326 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x000003c8:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000004)

0x000003db:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000008)

0x000003ef:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x0000041c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000042a:       NULL

0x0000042b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x00000458:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000466:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x00000326 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x00000476:       NULL

0x00000477:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x000004a7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000004b5:       NULL

0x000004b6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x000004e6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000004f4:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000507:       NULL

0x00000508:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x00000539:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000547:       NULL

0x00000548:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x00000579:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000587:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x0000059b:       NULL

0x0000059c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x000005ca:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000392 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000005d8:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000005e8:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x000005fb:       NULL

0x000005fc:     NULL

0x000005fd:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Bool")
                DW_AT_signature	(0x00000000)

0x00000613:     NULL

0x00000614:   DW_TAG_class_type
                DW_AT_name	("~lib/number/F32")
                DW_AT_signature	(0x00000000)

0x00000629:     NULL

0x0000062a:   DW_TAG_class_type
                DW_AT_name	("~lib/number/F64")
                DW_AT_signature	(0x00000000)

0x0000063f:     NULL

0x00000640:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I16")
                DW_AT_signature	(0x00000000)

0x00000655:     NULL

0x00000656:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I32")
                DW_AT_signature	(0x00000000)

0x0000066b:     NULL

0x0000066c:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I64")
                DW_AT_signature	(0x00000000)

0x00000681:     NULL

0x00000682:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I8")
                DW_AT_signature	(0x00000000)

0x00000696:     NULL

0x00000697:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Isize")
                DW_AT_signature	(0x00000000)

0x000006ae:     NULL

0x000006af:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U16")
                DW_AT_signature	(0x00000000)

0x000006c4:     NULL

0x000006c5:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U32")
                DW_AT_signature	(0x00000000)

0x000006da:     NULL

0x000006db:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U64")
                DW_AT_signature	(0x00000000)

0x000006f0:     NULL

0x000006f1:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U8")
                DW_AT_signature	(0x00000000)

0x00000705:     NULL

0x00000706:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Usize")
                DW_AT_signature	(0x00000000)

0x0000071d:     NULL

0x0000071e:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x00000736:     DW_TAG_subprogram
                  DW_AT_name	("~lib/object/Object#constructor")

0x00000756:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000071e "~lib/object/Object")
                    DW_AT_location	(0x00000000)

0x00000764:       NULL

0x00000765:     NULL

0x00000766:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x00000780:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000790:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x000007b1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000766 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x000007bf:       NULL

0x000007c0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x000007e1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000766 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x000007ef:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x000007ff:       NULL

0x00000800:     NULL

0x00000801:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x0000081c:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000004)

0x0000082c:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000008)

0x0000083d:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000084b:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000010)

0x0000085b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x0000087d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000801 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000088b:       NULL

0x0000088c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x000008ae:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000801 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000008bc:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x000008cc:       NULL

0x000008cd:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x000008f0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000801 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000008fe:       NULL

0x000008ff:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x00000922:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000801 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000930:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000941:       NULL

0x00000942:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x00000962:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000801 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000970:       NULL

0x00000971:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x00000991:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000801 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x0000099f:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x000009ad:       NULL

0x000009ae:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x000009d0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000801 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000009de:       NULL

0x000009df:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x00000a01:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000801 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000a0f:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000a1f:       NULL

0x00000a20:     NULL

0x00000a21:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x00000a3b:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000a52:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x00000a60:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x00000a6e:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000010)

0x00000a7e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x00000aa6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ab4:       NULL

0x00000ab5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x00000add:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000aeb:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000b02:       NULL

0x00000b03:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x00000b22:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b30:       NULL

0x00000b31:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x00000b50:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b5e:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000b6c:       NULL

0x00000b6d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x00000b8c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b9a:       NULL

0x00000b9b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x00000bba:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000bc8:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000bd6:       NULL

0x00000bd7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x00000bf8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c06:       NULL

0x00000c07:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x00000c28:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c36:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000c46:       NULL

0x00000c47:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x00000c66:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c74:       NULL

0x00000c75:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00000c94:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ca2:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000caf:       NULL

0x00000cb0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x00000cd0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000cde:       NULL

0x00000cdf:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x00000cff:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d0d:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000d1c:       NULL

0x00000d1d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00000d3c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d4a:       NULL

0x00000d4b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00000d68:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d76:       NULL

0x00000d77:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00000d94:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000da2:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000db0:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000dc3:       NULL

0x00000dc4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x00000dec:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000dfa:       NULL

0x00000dfb:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00000e1a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a21 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000e28:       NULL

0x00000e29:     NULL

0x00000e2a:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x00000e42:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000e2a "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x00000e50:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00000e2a "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x00000e5e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x00000e7b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e2a "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000e89:       NULL

0x00000e8a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00000ea7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e2a "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000eb5:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000e2a "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000ec3:       NULL

0x00000ec4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x00000ee1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e2a "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000eef:       NULL

0x00000ef0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x00000f0d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000e2a "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000f1b:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00000e2a "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000f29:       NULL

0x00000f2a:     NULL

0x00000f2b:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x00000f42:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000f51:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x00000f6e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000f2b "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000f7c:       NULL

0x00000f7d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00000f9a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000f2b "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000fa8:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000fb7:       NULL

0x00000fb8:     NULL

0x00000fb9:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x00000fdc:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000feb:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00001014:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000fb9 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00001022:       NULL

0x00001023:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x0000104c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000fb9 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x0000105a:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00001069:       NULL

0x0000106a:     NULL

0x0000106b:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x00001083:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x0000109e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000106b "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x000010ac:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000010b9:       NULL

0x000010ba:     NULL

0x000010bb:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000025 "i32")

0x000010e1:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x0000003f "u32")

0x000010fd:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x0000004d "usize")

0x00001119:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x0000004d "usize")

0x00001135:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x0000004d "usize")

0x00001157:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x0000117a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x00000010 "bool")

0x00001194:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x0000004d "usize")

0x000011b7:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x000011db:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x00000010 "bool")

0x000011f7:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x00000010 "bool")

0x00001212:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x00001235:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x00000010 "bool")

0x0000124f:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x00000025 "i32")

0x0000126d:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/GRANULARITY")
                DW_AT_type	(0x0000004d "usize")

0x0000128c:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/IDLEFACTOR")
                DW_AT_type	(0x0000004d "usize")

0x000012aa:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_IDLE")
                DW_AT_type	(0x00000025 "i32")

0x000012c8:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_MARK")
                DW_AT_type	(0x00000025 "i32")

