
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x00002c68 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00002c6c)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_base_type
                DW_AT_name	("bool")

0x00000016:   DW_TAG_base_type
                DW_AT_name	("f32")

0x0000001b:   DW_TAG_base_type
                DW_AT_name	("f64")

0x00000020:   DW_TAG_base_type
                DW_AT_name	("i16")

0x00000025:   DW_TAG_base_type
                DW_AT_name	("i32")

0x0000002a:   DW_TAG_base_type
                DW_AT_name	("i64")

0x0000002f:   DW_TAG_base_type
                DW_AT_name	("i8")

0x00000033:   DW_TAG_base_type
                DW_AT_name	("isize")

0x0000003a:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1")
                DW_AT_signature	(0x00000004)

0x00000069:     DW_TAG_member
                  DW_AT_name	("x")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000074:     DW_TAG_member
                  DW_AT_name	("y")
                  DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                  DW_AT_data_member_location	(0x00000004)

0x0000007f:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#get:x")

0x000000b0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x000000be:       NULL

0x000000bf:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#set:x")

0x000000f0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x000000fe:       DW_TAG_formal_parameter
                    DW_AT_name	("x")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000109:       NULL

0x0000010a:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#get:y")

0x0000013b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x00000149:       NULL

0x0000014a:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#set:y")

0x0000017b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x00000189:       DW_TAG_formal_parameter
                    DW_AT_name	("y")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000001)

0x00000194:       NULL

0x00000195:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/C1#constructor")

0x000001cc:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000003a "tests/DebugSymbol/TestClassMemberBasic/C1")
                    DW_AT_location	(0x00000000)

0x000001da:       NULL

0x000001db:     NULL

0x000001dc:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                DW_AT_signature	(0x00000006)

0x00000210:     DW_TAG_member
                  DW_AT_name	("a")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x0000021b:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x00000025 "i32")

0x00000220:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>#get:a")

0x00000256:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001dc "tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                    DW_AT_location	(0x00000000)

0x00000264:       NULL

0x00000265:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>#set:a")

0x0000029b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001dc "tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                    DW_AT_location	(0x00000000)

0x000002a9:       DW_TAG_formal_parameter
                    DW_AT_name	("a")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000002b4:       NULL

0x000002b5:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestClassMemberBasic/CT<i32>#constructor")

0x000002f1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000001dc "tests/DebugSymbol/TestClassMemberBasic/CT<i32>")
                    DW_AT_location	(0x00000000)

0x000002ff:       NULL

0x00000300:     NULL

0x00000301:   DW_TAG_base_type
                DW_AT_name	("u16")

0x00000306:   DW_TAG_base_type
                DW_AT_name	("u32")

0x0000030b:   DW_TAG_base_type
                DW_AT_name	("u64")

0x00000310:   DW_TAG_base_type
                DW_AT_name	("u8")

0x00000314:   DW_TAG_base_type
                DW_AT_name	("usize")

0x0000031b:   DW_TAG_class_type
                DW_AT_name	("~lib/array/Array<i32>")
                DW_AT_signature	(0x00000005)

0x00000336:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x000006a5 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x00000346:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x00000314 "usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000359:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000008)

0x0000036d:     DW_TAG_member
                  DW_AT_name	("length_")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x0000000c)

0x0000037e:     DW_TAG_template_type_parameter
                  DW_AT_type	(0x00000025 "i32")

0x00000383:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#get:buffer")

0x000003a5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000003b3:       NULL

0x000003b4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#set:buffer")

0x000003d6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000003e4:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x000006a5 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x000003f4:       NULL

0x000003f5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#get:dataStart")

0x0000041a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000428:       NULL

0x00000429:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#set:dataStart")

0x0000044e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x0000045c:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x00000314 "usize")
                    DW_AT_location	(0x00000001)

0x0000046f:       NULL

0x00000470:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#get:byteLength")

0x00000496:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000004a4:       NULL

0x000004a5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#set:byteLength")

0x000004cb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000004d9:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000004ed:       NULL

0x000004ee:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#get:length_")

0x00000511:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x0000051f:       NULL

0x00000520:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#set:length_")

0x00000543:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000551:       DW_TAG_formal_parameter
                    DW_AT_name	("length_")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000562:       NULL

0x00000563:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#constructor")

0x00000586:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000594:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000005a4:       NULL

0x000005a5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#__get")

0x000005c2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x000005d0:       DW_TAG_formal_parameter
                    DW_AT_name	("index")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000005df:       NULL

0x000005e0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#__uget")

0x000005fe:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x0000060c:       DW_TAG_formal_parameter
                    DW_AT_name	("index")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x0000061b:       NULL

0x0000061c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#__set")

0x00000639:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000647:       DW_TAG_formal_parameter
                    DW_AT_name	("index")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000656:       DW_TAG_formal_parameter
                    DW_AT_name	("value")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000665:       NULL

0x00000666:     DW_TAG_subprogram
                  DW_AT_name	("~lib/array/Array<i32>#__visit")

0x00000685:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031b "~lib/array/Array<i32>")
                    DW_AT_location	(0x00000000)

0x00000693:       DW_TAG_formal_parameter
                    DW_AT_name	("cookie")
                    DW_AT_type	(0x00000306 "u32")
                    DW_AT_location	(0x00000001)

0x000006a3:       NULL

0x000006a4:     NULL

0x000006a5:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x000006c7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x000006f1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006a5 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x000006ff:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x0000070f:       NULL

0x00000710:     NULL

0x00000711:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x00000737:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x000006a5 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x00000747:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x00000314 "usize")
                  DW_AT_data_member_location	(0x00000004)

0x0000075a:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000008)

0x0000076e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x0000079b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000007a9:       NULL

0x000007aa:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x000007d7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000007e5:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x000006a5 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x000007f5:       NULL

0x000007f6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x00000826:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000834:       NULL

0x00000835:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x00000865:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000873:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x00000314 "usize")
                    DW_AT_location	(0x00000001)

0x00000886:       NULL

0x00000887:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x000008b8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000008c6:       NULL

0x000008c7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x000008f8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000906:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x0000091a:       NULL

0x0000091b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x00000949:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000711 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000957:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000967:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x0000097a:       NULL

0x0000097b:     NULL

0x0000097c:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x00000994:     DW_TAG_subprogram
                  DW_AT_name	("~lib/object/Object#constructor")

0x000009b4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000097c "~lib/object/Object")
                    DW_AT_location	(0x00000000)

0x000009c2:       NULL

0x000009c3:     NULL

0x000009c4:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x000009de:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x00000314 "usize")
                  DW_AT_data_member_location	(0x00000000)

0x000009ee:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x00000a0f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009c4 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000a1d:       NULL

0x00000a1e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x00000a3f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009c4 "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000a4d:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x00000314 "usize")
                    DW_AT_location	(0x00000001)

0x00000a5d:       NULL

0x00000a5e:     NULL

0x00000a5f:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x00000a7a:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x00000306 "u32")
                  DW_AT_data_member_location	(0x00000004)

0x00000a8a:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x00000306 "u32")
                  DW_AT_data_member_location	(0x00000008)

0x00000a9b:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000306 "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x00000aa9:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000306 "u32")
                  DW_AT_data_member_location	(0x00000010)

0x00000ab9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x00000adb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a5f "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000ae9:       NULL

0x00000aea:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x00000b0c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a5f "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000b1a:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x00000306 "u32")
                    DW_AT_location	(0x00000001)

0x00000b2a:       NULL

0x00000b2b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x00000b4e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a5f "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000b5c:       NULL

0x00000b5d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x00000b80:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a5f "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000b8e:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x00000306 "u32")
                    DW_AT_location	(0x00000001)

0x00000b9f:       NULL

0x00000ba0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x00000bc0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a5f "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000bce:       NULL

0x00000bcf:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x00000bef:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a5f "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000bfd:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x00000306 "u32")
                    DW_AT_location	(0x00000001)

0x00000c0b:       NULL

0x00000c0c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x00000c2e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a5f "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000c3c:       NULL

0x00000c3d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x00000c5f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000a5f "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000c6d:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x00000306 "u32")
                    DW_AT_location	(0x00000001)

0x00000c7d:       NULL

0x00000c7e:     NULL

0x00000c7f:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x00000c99:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x00000314 "usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000cb0:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x00000cbe:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x00000306 "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x00000ccc:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x00000306 "u32")
                  DW_AT_data_member_location	(0x00000010)

0x00000cdc:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x00000d04:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d12:       NULL

0x00000d13:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x00000d3b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d49:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x00000314 "usize")
                    DW_AT_location	(0x00000001)

0x00000d60:       NULL

0x00000d61:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x00000d80:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d8e:       NULL

0x00000d8f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x00000dae:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000dbc:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000dca:       NULL

0x00000dcb:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x00000dea:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000df8:       NULL

0x00000df9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x00000e18:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000e26:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x00000306 "u32")
                    DW_AT_location	(0x00000001)

0x00000e34:       NULL

0x00000e35:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x00000e56:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000e64:       NULL

0x00000e65:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x00000e86:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000e94:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x00000306 "u32")
                    DW_AT_location	(0x00000001)

0x00000ea4:       NULL

0x00000ea5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x00000ec4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ed2:       NULL

0x00000ed3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00000ef2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000f00:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000f0d:       NULL

0x00000f0e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x00000f2e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000f3c:       NULL

0x00000f3d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x00000f5d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000f6b:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000f7a:       NULL

0x00000f7b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00000f9a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000fa8:       NULL

0x00000fa9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00000fc6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000fd4:       NULL

0x00000fd5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00000ff2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00001000:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x0000100e:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00001021:       NULL

0x00001022:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x0000104a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00001058:       NULL

0x00001059:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00001078:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c7f "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00001086:       NULL

0x00001087:     NULL

0x00001088:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x000010a0:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00001088 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x000010ae:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00001088 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x000010bc:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x000010d9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001088 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x000010e7:       NULL

0x000010e8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00001105:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001088 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00001113:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00001088 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00001121:       NULL

0x00001122:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x0000113f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001088 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x0000114d:       NULL

0x0000114e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x0000116b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001088 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00001179:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00001088 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00001187:       NULL

0x00001188:     NULL

0x00001189:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x000011a0:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x00000314 "usize")
                  DW_AT_data_member_location	(0x00000000)

0x000011af:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x000011cc:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001189 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x000011da:       NULL

0x000011db:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x000011f8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001189 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00001206:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x00000314 "usize")
                    DW_AT_location	(0x00000001)

0x00001215:       NULL

0x00001216:     NULL

0x00001217:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x0000123a:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00001249:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00001272:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001217 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00001280:       NULL

0x00001281:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x000012aa:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00001217 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x000012b8:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000012c7:       NULL

0x000012c8:     NULL

0x000012c9:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x000012e1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x000012fc:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000012c9 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x0000130a:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00001317:       NULL

0x00001318:     NULL

0x00001319:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000025 "i32")

0x0000133f:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x00000306 "u32")

0x0000135b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x00000314 "usize")

0x00001377:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x00000314 "usize")

0x00001393:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x00000314 "usize")

0x000013b5:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x00000314 "usize")

0x000013d8:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x00000010 "bool")

0x000013f2:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x00000314 "usize")

0x00001415:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x00000314 "usize")

0x00001439:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x00000010 "bool")

0x00001455:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x00000010 "bool")

0x00001470:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x00000314 "usize")

0x00001493:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x00000010 "bool")

0x000014ad:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x00000025 "i32")

0x000014cb:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/GRANULARITY")
                DW_AT_type	(0x00000314 "usize")

0x000014ea:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/IDLEFACTOR")
                DW_AT_type	(0x00000314 "usize")

0x00001508:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_IDLE")
                DW_AT_type	(0x00000025 "i32")

0x00001526:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_MARK")
                DW_AT_type	(0x00000025 "i32")

