
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[9] DW_TAG_lexical_block	DW_CHILDREN_yes
	DW_AT_low_pc	DW_FORM_addr
	DW_AT_high_pc	DW_FORM_addr

[10] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x00002b88 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00002b8c)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_base_type
                DW_AT_name	("bool")

0x00000016:   DW_TAG_base_type
                DW_AT_name	("f32")

0x0000001b:   DW_TAG_base_type
                DW_AT_name	("f64")

0x00000020:   DW_TAG_base_type
                DW_AT_name	("i16")

0x00000025:   DW_TAG_base_type
                DW_AT_name	("i32")

0x0000002a:   DW_TAG_base_type
                DW_AT_name	("i64")

0x0000002f:   DW_TAG_base_type
                DW_AT_name	("i8")

0x00000033:   DW_TAG_base_type
                DW_AT_name	("isize")

0x0000003a:   DW_TAG_base_type
                DW_AT_name	("u16")

0x0000003f:   DW_TAG_base_type
                DW_AT_name	("u32")

0x00000044:   DW_TAG_base_type
                DW_AT_name	("u64")

0x00000049:   DW_TAG_base_type
                DW_AT_name	("u8")

0x0000004d:   DW_TAG_base_type
                DW_AT_name	("usize")

0x00000054:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x00000076:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x000000a0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x000000ae:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000000be:       NULL

0x000000bf:     NULL

0x000000c0:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x000000e6:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x00000054 "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x000000f6:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000109:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000008)

0x0000011d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x0000014a:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000000c0 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000158:       NULL

0x00000159:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x00000186:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000000c0 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000194:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x00000054 "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x000001a4:       NULL

0x000001a5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x000001d5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000000c0 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000001e3:       NULL

0x000001e4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x00000214:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000000c0 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000222:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000235:       NULL

0x00000236:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x00000267:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000000c0 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000275:       NULL

0x00000276:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x000002a7:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000000c0 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000002b5:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000002c9:       NULL

0x000002ca:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x000002f8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000000c0 "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000306:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000316:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000329:       NULL

0x0000032a:     NULL

0x0000032b:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Bool")
                DW_AT_signature	(0x00000000)

0x00000341:     NULL

0x00000342:   DW_TAG_class_type
                DW_AT_name	("~lib/number/F32")
                DW_AT_signature	(0x00000000)

0x00000357:     DW_TAG_subprogram
                  DW_AT_name	("~lib/number/F32#toString")

0x00000371:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000016 "f32")
                    DW_AT_location	(0x00000000)

0x0000037f:       DW_TAG_formal_parameter
                    DW_AT_name	("radix")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x0000038e:       NULL

0x0000038f:     NULL

0x00000390:   DW_TAG_class_type
                DW_AT_name	("~lib/number/F64")
                DW_AT_signature	(0x00000000)

0x000003a5:     NULL

0x000003a6:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I16")
                DW_AT_signature	(0x00000000)

0x000003bb:     NULL

0x000003bc:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I32")
                DW_AT_signature	(0x00000000)

0x000003d1:     NULL

0x000003d2:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I64")
                DW_AT_signature	(0x00000000)

0x000003e7:     NULL

0x000003e8:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I8")
                DW_AT_signature	(0x00000000)

0x000003fc:     NULL

0x000003fd:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Isize")
                DW_AT_signature	(0x00000000)

0x00000414:     NULL

0x00000415:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U16")
                DW_AT_signature	(0x00000000)

0x0000042a:     NULL

0x0000042b:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U32")
                DW_AT_signature	(0x00000000)

0x00000440:     NULL

0x00000441:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U64")
                DW_AT_signature	(0x00000000)

0x00000456:     NULL

0x00000457:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U8")
                DW_AT_signature	(0x00000000)

0x0000046b:     NULL

0x0000046c:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Usize")
                DW_AT_signature	(0x00000000)

0x00000483:     NULL

0x00000484:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x0000049c:     NULL

0x0000049d:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x000004b7:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000000)

0x000004c7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x000004e8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000049d "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x000004f6:       NULL

0x000004f7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x00000518:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000049d "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000526:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000536:       NULL

0x00000537:     NULL

0x00000538:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x00000553:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000004)

0x00000563:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000008)

0x00000574:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x00000582:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000010)

0x00000592:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x000005b4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000538 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000005c2:       NULL

0x000005c3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x000005e5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000538 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000005f3:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000603:       NULL

0x00000604:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x00000627:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000538 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000635:       NULL

0x00000636:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x00000659:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000538 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000667:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000678:       NULL

0x00000679:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x00000699:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000538 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000006a7:       NULL

0x000006a8:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x000006c8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000538 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000006d6:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x000006e4:       NULL

0x000006e5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x00000707:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000538 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000715:       NULL

0x00000716:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x00000738:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000538 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000746:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000756:       NULL

0x00000757:     NULL

0x00000758:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x00000772:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000789:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x00000797:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x000007a5:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000010)

0x000007b5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x000007dd:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000007eb:       NULL

0x000007ec:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x00000814:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000822:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000839:       NULL

0x0000083a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x00000859:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000867:       NULL

0x00000868:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x00000887:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000895:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x000008a3:       NULL

0x000008a4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x000008c3:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000008d1:       NULL

0x000008d2:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x000008f1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000008ff:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x0000090d:       NULL

0x0000090e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x0000092f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x0000093d:       NULL

0x0000093e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x0000095f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x0000096d:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x0000097d:       NULL

0x0000097e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x0000099d:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000009ab:       NULL

0x000009ac:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x000009cb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x000009d9:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x000009e6:       NULL

0x000009e7:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x00000a07:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a15:       NULL

0x00000a16:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x00000a36:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a44:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000a53:       NULL

0x00000a54:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00000a73:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a81:       NULL

0x00000a82:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00000a9f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000aad:       NULL

0x00000aae:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00000acb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ad9:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000ae7:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000afa:       NULL

0x00000afb:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x00000b23:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b31:       NULL

0x00000b32:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00000b51:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000758 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b5f:       NULL

0x00000b60:     NULL

0x00000b61:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x00000b79:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000b61 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x00000b87:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00000b61 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x00000b95:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x00000bb2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b61 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000bc0:       NULL

0x00000bc1:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00000bde:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b61 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000bec:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000b61 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000bfa:       NULL

0x00000bfb:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x00000c18:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b61 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000c26:       NULL

0x00000c27:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x00000c44:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000b61 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000c52:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00000b61 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000c60:       NULL

0x00000c61:     NULL

0x00000c62:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x00000c79:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000c88:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x00000ca5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c62 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000cb3:       NULL

0x00000cb4:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00000cd1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000c62 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000cdf:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000cee:       NULL

0x00000cef:     NULL

0x00000cf0:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x00000d13:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000d22:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00000d4b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000cf0 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000d59:       NULL

0x00000d5a:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x00000d83:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000cf0 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000d91:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000da0:       NULL

0x00000da1:     NULL

0x00000da2:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x00000dba:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x00000dd5:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000da2 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00000de3:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000df0:       NULL

0x00000df1:     NULL

0x00000df2:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000025 "i32")

0x00000e18:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_SHRINK_LEVEL")
                DW_AT_type	(0x00000025 "i32")

0x00000e3a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x0000003f "u32")

0x00000e56:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x0000004d "usize")

0x00000e72:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x0000004d "usize")

0x00000e8e:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x0000004d "usize")

0x00000eb0:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x00000ed3:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x00000010 "bool")

0x00000eed:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x0000004d "usize")

0x00000f10:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x00000f34:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x00000010 "bool")

0x00000f50:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
                DW_AT_type	(0x00000010 "bool")

0x00000f6b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TOTAL_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x00000f8e:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/TRACE")
                DW_AT_type	(0x00000010 "bool")

0x00000fa8:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/COLOR_MASK")
                DW_AT_type	(0x00000025 "i32")

0x00000fc6:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/GRANULARITY")
                DW_AT_type	(0x0000004d "usize")

0x00000fe5:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/IDLEFACTOR")
                DW_AT_type	(0x0000004d "usize")

0x00001003:   DW_TAG_variable
                DW_AT_name	("~lib/rt/itcms/STATE_IDLE")
