
.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strp

[2] DW_TAG_class_type	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string
	DW_AT_signature	DW_FORM_data4

[3] DW_TAG_member	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_data_member_location	DW_FORM_data4

[4] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string

[5] DW_TAG_template_type_parameter	DW_CHILDREN_no
	DW_AT_type	DW_FORM_ref4

[6] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4

[7] DW_TAG_variable	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[8] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_name	DW_FORM_string
	DW_AT_type	DW_FORM_ref4
	DW_AT_location	DW_FORM_data4

[9] DW_TAG_lexical_block	DW_CHILDREN_yes
	DW_AT_low_pc	DW_FORM_addr
	DW_AT_high_pc	DW_FORM_addr

[10] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_name	DW_FORM_string


.debug_info contents:
0x00000000: Compile Unit: length = 0x00002aa8 version = 0x0004 abbr_offset = 0x0000 addr_size = 0x04 (next unit at 0x00002aac)

0x0000000b: DW_TAG_compile_unit
              DW_AT_producer	("warpo")

0x00000010:   DW_TAG_base_type
                DW_AT_name	("bool")

0x00000016:   DW_TAG_base_type
                DW_AT_name	("f32")

0x0000001b:   DW_TAG_base_type
                DW_AT_name	("f64")

0x00000020:   DW_TAG_base_type
                DW_AT_name	("i16")

0x00000025:   DW_TAG_base_type
                DW_AT_name	("i32")

0x0000002a:   DW_TAG_base_type
                DW_AT_name	("i64")

0x0000002f:   DW_TAG_base_type
                DW_AT_name	("i8")

0x00000033:   DW_TAG_base_type
                DW_AT_name	("isize")

0x0000003a:   DW_TAG_base_type
                DW_AT_name	("u16")

0x0000003f:   DW_TAG_base_type
                DW_AT_name	("u32")

0x00000044:   DW_TAG_base_type
                DW_AT_name	("u64")

0x00000049:   DW_TAG_base_type
                DW_AT_name	("u8")

0x0000004d:   DW_TAG_base_type
                DW_AT_name	("usize")

0x00000054:   DW_TAG_class_type
                DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator")
                DW_AT_signature	(0x00000004)

0x0000008c:     DW_TAG_member
                  DW_AT_name	("value")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x0000009b:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#get:value")

0x000000d9:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x000000e7:       NULL

0x000000e8:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#set:value")

0x00000126:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x00000134:       DW_TAG_formal_parameter
                    DW_AT_name	("value")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000143:       NULL

0x00000144:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#constructor")

0x00000184:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x00000192:       NULL

0x00000193:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#add")

0x000001cb:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x000001d9:       DW_TAG_formal_parameter
                    DW_AT_name	("a")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x000001e4:       DW_TAG_formal_parameter
                    DW_AT_name	("b")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x000001ef:       NULL

0x000001f0:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#processNullable")

0x00000234:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x00000242:       DW_TAG_formal_parameter
                    DW_AT_name	("input")
                    DW_AT_type	(0x00000ff3 "~lib/string/String")
                    DW_AT_location	(0x00000001)

0x00000251:       NULL

0x00000252:     DW_TAG_subprogram
                  DW_AT_name	("tests/DebugSymbol/TestFunctionParameter/Calculator#getLength")

0x00000290:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000054 "tests/DebugSymbol/TestFunctionParameter/Calculator")
                    DW_AT_location	(0x00000000)

0x0000029e:       DW_TAG_formal_parameter
                    DW_AT_name	("text")
                    DW_AT_type	(0x00000ff3 "~lib/string/String")
                    DW_AT_location	(0x00000001)

0x000002ac:       NULL

0x000002ad:     NULL

0x000002ae:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBuffer")
                DW_AT_signature	(0x00000001)

0x000002d0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBuffer#constructor")

0x000002fa:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000002ae "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000000)

0x00000308:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000318:       NULL

0x00000319:     NULL

0x0000031a:   DW_TAG_class_type
                DW_AT_name	("~lib/arraybuffer/ArrayBufferView")
                DW_AT_signature	(0x00000003)

0x00000340:     DW_TAG_member
                  DW_AT_name	("buffer")
                  DW_AT_type	(0x000002ae "~lib/arraybuffer/ArrayBuffer")
                  DW_AT_data_member_location	(0x00000000)

0x00000350:     DW_TAG_member
                  DW_AT_name	("dataStart")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000004)

0x00000363:     DW_TAG_member
                  DW_AT_name	("byteLength")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000008)

0x00000377:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:buffer")

0x000003a4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003b2:       NULL

0x000003b3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:buffer")

0x000003e0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000003ee:       DW_TAG_formal_parameter
                    DW_AT_name	("buffer")
                    DW_AT_type	(0x000002ae "~lib/arraybuffer/ArrayBuffer")
                    DW_AT_location	(0x00000001)

0x000003fe:       NULL

0x000003ff:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:dataStart")

0x0000042f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000043d:       NULL

0x0000043e:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:dataStart")

0x0000046e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000047c:       DW_TAG_formal_parameter
                    DW_AT_name	("dataStart")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x0000048f:       NULL

0x00000490:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#get:byteLength")

0x000004c1:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x000004cf:       NULL

0x000004d0:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#set:byteLength")

0x00000501:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x0000050f:       DW_TAG_formal_parameter
                    DW_AT_name	("byteLength")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000523:       NULL

0x00000524:     DW_TAG_subprogram
                  DW_AT_name	("~lib/arraybuffer/ArrayBufferView#constructor")

0x00000552:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x0000031a "~lib/arraybuffer/ArrayBufferView")
                    DW_AT_location	(0x00000000)

0x00000560:       DW_TAG_formal_parameter
                    DW_AT_name	("length")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000570:       DW_TAG_formal_parameter
                    DW_AT_name	("alignLog2")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000583:       NULL

0x00000584:     NULL

0x00000585:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Bool")
                DW_AT_signature	(0x00000000)

0x0000059b:     NULL

0x0000059c:   DW_TAG_class_type
                DW_AT_name	("~lib/number/F32")
                DW_AT_signature	(0x00000000)

0x000005b1:     NULL

0x000005b2:   DW_TAG_class_type
                DW_AT_name	("~lib/number/F64")
                DW_AT_signature	(0x00000000)

0x000005c7:     NULL

0x000005c8:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I16")
                DW_AT_signature	(0x00000000)

0x000005dd:     NULL

0x000005de:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I32")
                DW_AT_signature	(0x00000000)

0x000005f3:     NULL

0x000005f4:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I64")
                DW_AT_signature	(0x00000000)

0x00000609:     NULL

0x0000060a:   DW_TAG_class_type
                DW_AT_name	("~lib/number/I8")
                DW_AT_signature	(0x00000000)

0x0000061e:     NULL

0x0000061f:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Isize")
                DW_AT_signature	(0x00000000)

0x00000636:     NULL

0x00000637:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U16")
                DW_AT_signature	(0x00000000)

0x0000064c:     NULL

0x0000064d:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U32")
                DW_AT_signature	(0x00000000)

0x00000662:     NULL

0x00000663:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U64")
                DW_AT_signature	(0x00000000)

0x00000678:     NULL

0x00000679:   DW_TAG_class_type
                DW_AT_name	("~lib/number/U8")
                DW_AT_signature	(0x00000000)

0x0000068d:     NULL

0x0000068e:   DW_TAG_class_type
                DW_AT_name	("~lib/number/Usize")
                DW_AT_signature	(0x00000000)

0x000006a5:     NULL

0x000006a6:   DW_TAG_class_type
                DW_AT_name	("~lib/object/Object")
                DW_AT_signature	(0x00000000)

0x000006be:     DW_TAG_subprogram
                  DW_AT_name	("~lib/object/Object#constructor")

0x000006de:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006a6 "~lib/object/Object")
                    DW_AT_location	(0x00000000)

0x000006ec:       NULL

0x000006ed:     NULL

0x000006ee:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/BLOCK")
                DW_AT_signature	(0x00000000)

0x00000708:     DW_TAG_member
                  DW_AT_name	("mmInfo")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000718:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#get:mmInfo")

0x00000739:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006ee "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000747:       NULL

0x00000748:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/BLOCK#set:mmInfo")

0x00000769:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000006ee "~lib/rt/common/BLOCK")
                    DW_AT_location	(0x00000000)

0x00000777:       DW_TAG_formal_parameter
                    DW_AT_name	("mmInfo")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000787:       NULL

0x00000788:     NULL

0x00000789:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/common/OBJECT")
                DW_AT_signature	(0x00000000)

0x000007a4:     DW_TAG_member
                  DW_AT_name	("gcInfo")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000004)

0x000007b4:     DW_TAG_member
                  DW_AT_name	("gcInfo2")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000008)

0x000007c5:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x000007d3:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000010)

0x000007e3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo")

0x00000805:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000789 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000813:       NULL

0x00000814:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo")

0x00000836:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000789 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000844:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000854:       NULL

0x00000855:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:gcInfo2")

0x00000878:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000789 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000886:       NULL

0x00000887:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:gcInfo2")

0x000008aa:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000789 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000008b8:       DW_TAG_formal_parameter
                    DW_AT_name	("gcInfo2")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x000008c9:       NULL

0x000008ca:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtId")

0x000008ea:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000789 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x000008f8:       NULL

0x000008f9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtId")

0x00000919:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000789 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000927:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000935:       NULL

0x00000936:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#get:rtSize")

0x00000958:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000789 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000966:       NULL

0x00000967:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/common/OBJECT#set:rtSize")

0x00000989:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000789 "~lib/rt/common/OBJECT")
                    DW_AT_location	(0x00000000)

0x00000997:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x000009a7:       NULL

0x000009a8:     NULL

0x000009a9:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/itcms/Object")
                DW_AT_signature	(0x00000000)

0x000009c3:     DW_TAG_member
                  DW_AT_name	("nextWithColor")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000004)

0x000009da:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                  DW_AT_data_member_location	(0x00000008)

0x000009e8:     DW_TAG_member
                  DW_AT_name	("rtId")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x0000000c)

0x000009f6:     DW_TAG_member
                  DW_AT_name	("rtSize")
                  DW_AT_type	(0x0000003f "u32")
                  DW_AT_data_member_location	(0x00000010)

0x00000a06:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:nextWithColor")

0x00000a2e:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a3c:       NULL

0x00000a3d:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:nextWithColor")

0x00000a65:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000a73:       DW_TAG_formal_parameter
                    DW_AT_name	("nextWithColor")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000a8a:       NULL

0x00000a8b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:prev")

0x00000aaa:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ab8:       NULL

0x00000ab9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:prev")

0x00000ad8:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000ae6:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000af4:       NULL

0x00000af5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtId")

0x00000b14:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b22:       NULL

0x00000b23:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtId")

0x00000b42:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b50:       DW_TAG_formal_parameter
                    DW_AT_name	("rtId")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000b5e:       NULL

0x00000b5f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:rtSize")

0x00000b80:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000b8e:       NULL

0x00000b8f:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:rtSize")

0x00000bb0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000bbe:       DW_TAG_formal_parameter
                    DW_AT_name	("rtSize")
                    DW_AT_type	(0x0000003f "u32")
                    DW_AT_location	(0x00000001)

0x00000bce:       NULL

0x00000bcf:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:next")

0x00000bee:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000bfc:       NULL

0x00000bfd:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:next")

0x00000c1c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c2a:       DW_TAG_formal_parameter
                    DW_AT_name	("obj")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000c37:       NULL

0x00000c38:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:color")

0x00000c58:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c66:       NULL

0x00000c67:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#set:color")

0x00000c87:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000c95:       DW_TAG_formal_parameter
                    DW_AT_name	("color")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000ca4:       NULL

0x00000ca5:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#makeGray")

0x00000cc4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000cd2:       NULL

0x00000cd3:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#unlink")

0x00000cf0:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000cfe:       NULL

0x00000cff:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#linkTo")

0x00000d1c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d2a:       DW_TAG_formal_parameter
                    DW_AT_name	("list")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000001)

0x00000d38:       DW_TAG_formal_parameter
                    DW_AT_name	("withColor")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000002)

0x00000d4b:       NULL

0x00000d4c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:isPointerfree")

0x00000d74:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000d82:       NULL

0x00000d83:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/itcms/Object#get:size")

0x00000da2:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x000009a9 "~lib/rt/itcms/Object")
                    DW_AT_location	(0x00000000)

0x00000db0:       NULL

0x00000db1:     NULL

0x00000db2:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Block")
                DW_AT_signature	(0x00000000)

0x00000dca:     DW_TAG_member
                  DW_AT_name	("prev")
                  DW_AT_type	(0x00000db2 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000004)

0x00000dd8:     DW_TAG_member
                  DW_AT_name	("next")
                  DW_AT_type	(0x00000db2 "~lib/rt/tlsf/Block")
                  DW_AT_data_member_location	(0x00000008)

0x00000de6:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:prev")

0x00000e03:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000db2 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000e11:       NULL

0x00000e12:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:prev")

0x00000e2f:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000db2 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000e3d:       DW_TAG_formal_parameter
                    DW_AT_name	("prev")
                    DW_AT_type	(0x00000db2 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000e4b:       NULL

0x00000e4c:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#get:next")

0x00000e69:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000db2 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000e77:       NULL

0x00000e78:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Block#set:next")

0x00000e95:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000db2 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000000)

0x00000ea3:       DW_TAG_formal_parameter
                    DW_AT_name	("next")
                    DW_AT_type	(0x00000db2 "~lib/rt/tlsf/Block")
                    DW_AT_location	(0x00000001)

0x00000eb1:       NULL

0x00000eb2:     NULL

0x00000eb3:   DW_TAG_class_type
                DW_AT_name	("~lib/rt/tlsf/Root")
                DW_AT_signature	(0x00000000)

0x00000eca:     DW_TAG_member
                  DW_AT_name	("flMap")
                  DW_AT_type	(0x0000004d "usize")
                  DW_AT_data_member_location	(0x00000000)

0x00000ed9:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#get:flMap")

0x00000ef6:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000eb3 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000f04:       NULL

0x00000f05:     DW_TAG_subprogram
                  DW_AT_name	("~lib/rt/tlsf/Root#set:flMap")

0x00000f22:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000eb3 "~lib/rt/tlsf/Root")
                    DW_AT_location	(0x00000000)

0x00000f30:       DW_TAG_formal_parameter
                    DW_AT_name	("flMap")
                    DW_AT_type	(0x0000004d "usize")
                    DW_AT_location	(0x00000001)

0x00000f3f:       NULL

0x00000f40:     NULL

0x00000f41:   DW_TAG_class_type
                DW_AT_name	("~lib/shared/typeinfo/Typeinfo")
                DW_AT_signature	(0x00000000)

0x00000f64:     DW_TAG_member
                  DW_AT_name	("flags")
                  DW_AT_type	(0x00000025 "i32")
                  DW_AT_data_member_location	(0x00000000)

0x00000f73:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#get:flags")

0x00000f9c:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000f41 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000faa:       NULL

0x00000fab:     DW_TAG_subprogram
                  DW_AT_name	("~lib/shared/typeinfo/Typeinfo#set:flags")

0x00000fd4:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000f41 "~lib/shared/typeinfo/Typeinfo")
                    DW_AT_location	(0x00000000)

0x00000fe2:       DW_TAG_formal_parameter
                    DW_AT_name	("flags")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00000ff1:       NULL

0x00000ff2:     NULL

0x00000ff3:   DW_TAG_class_type
                DW_AT_name	("~lib/string/String")
                DW_AT_signature	(0x00000002)

0x0000100b:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#charAt")

0x00001026:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ff3 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00001034:       DW_TAG_formal_parameter
                    DW_AT_name	("pos")
                    DW_AT_type	(0x00000025 "i32")
                    DW_AT_location	(0x00000001)

0x00001041:       NULL

0x00001042:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#get:length")

0x00001061:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ff3 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x0000106f:       NULL

0x00001070:     DW_TAG_subprogram
                  DW_AT_name	("~lib/string/String#concat")

0x0000108b:       DW_TAG_formal_parameter
                    DW_AT_name	("this")
                    DW_AT_type	(0x00000ff3 "~lib/string/String")
                    DW_AT_location	(0x00000000)

0x00001099:       DW_TAG_formal_parameter
                    DW_AT_name	("other")
                    DW_AT_type	(0x00000ff3 "~lib/string/String")
                    DW_AT_location	(0x00000001)

0x000010a8:       NULL

0x000010a9:     NULL

0x000010aa:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_LOW_MEMORY_LIMIT")
                DW_AT_type	(0x00000025 "i32")

0x000010d0:   DW_TAG_variable
                DW_AT_name	("~lib/native/ASC_SHRINK_LEVEL")
                DW_AT_type	(0x00000025 "i32")

0x000010f2:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_BITS")
                DW_AT_type	(0x0000003f "u32")

0x0000110e:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_MASK")
                DW_AT_type	(0x0000004d "usize")

0x0000112a:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/AL_SIZE")
                DW_AT_type	(0x0000004d "usize")

0x00001146:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_MAXSIZE")
                DW_AT_type	(0x0000004d "usize")

0x00001168:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/BLOCK_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x0000118b:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/DEBUG")
                DW_AT_type	(0x00000010 "bool")

0x000011a5:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_MAXSIZE")
                DW_AT_type	(0x0000004d "usize")

0x000011c8:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/OBJECT_OVERHEAD")
                DW_AT_type	(0x0000004d "usize")

0x000011ec:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/PROFILE")
                DW_AT_type	(0x00000010 "bool")

0x00001208:   DW_TAG_variable
                DW_AT_name	("~lib/rt/common/RTRACE")
